{
    "inicio": "Inici",
    "proyectos": "Projectes",
    "about": "Sobre Mi",
    "desarrollo_android": "Desenvolupament Android",
    "desarrollo_web": "Desenvolupament Web",
    "proyectos_python": "Projectes en Python",
    "inteligencia_artificial": "Intel·ligència Artificial",
    "otros": "Altres",
    "cambiar_modo_oscuro": "Canviar a mode fosc",
    "seleccionarIdioma": "Seleccionar idioma",
    "aboutme": "Sóc graduat en Enginyeria Informàtica per la UAB, especialitzat en Enginyeria de Programari. Em considero una persona proactiva i apassionada per la programació, sempre enfocada en assolir resultats d'alta qualitat. M'encanta assumir nous reptes, independentment de la tecnologia o el llenguatge, i estic disposat a aprendre qualsevol eina necessària. Al llarg de la meva experiència, he desenvolupat projectes que abasten des d'aplicacions Android fins a pàgines web, sempre amb l'objectiu d'optimitzar el rendiment i la qualitat del codi. La meva motivació diària és millorar i seguir aprenent.",
    "moreInfo": "Si vols més informació sobre mi, visita <a href='pages/sobre-mi.html#about'>sobre mi</a>.",
    "contactar": "Contactar",
    "mail": "Tria com enviar el teu correu",
    "confirmarEnvio": "Confirmar enviament",
    "copiar": "Copiar",
    "mensajeCopiado": "Correu copiat al portapapers!",
    "info": "Enginyer Informàtic, Menció Enginyeria de Programari",
    "formacion": "Formació",
    "infoFormacion": "Al llarg de la meva formació he estudiat a: ",
    "moreInfoFormacion": "Si vols més informació sobre la meva formació, visita <a href='pages/sobre-mi.html#formacion'>la meva formació completa</a>.",
    "habilidades": "Habilitats",
    "habilidadesTecnicas": "Habilitats Tècniques",
    "conocimientosBasicos": "Mostrar Coneixements Bàsics",
    "conocimientosCompletos": "Mostrar Coneixements Complets",
    "otrosLenguajes": "Altres Llenguatges",
    "python": "Python (Aplicacions d'escriptori i IA)",
    "lua": "Lua (Scripting embegut)",
    "C": "C (Aplicacions embegudes)",
    "dart": "Dart (Desenvolupament mòbil)",
    "herramientas": "Eines",
    "metodologia": "Metodologia Àgil",
    "otras": "Altres",
    "habilidadesBlandas": "Habilitats toves",
    "trabajoEnEquipo": "Treball en equip <span class='tooltip-skills'>Col·laboro de manera eficient amb altres per assolir objectius comuns.</span>",
    "adaptabilidad": "Adaptabilitat <span class='tooltip-skills'>Sóc capaç d'ajustar estratègies i mètodes de treball en entorns canviants.</span>",
    "resolucionProblemas": "Resolució de problemes <span class='tooltip-skills'>Identifico i soluciono problemes de manera efectiva i creativa.</span>",
    "gestionTiempo": "Gestió del temps <span class='tooltip-skills'>Organitzo i prioritzo tasques per complir amb els terminis establerts.</span>",
    "flexibilidad": "Flexibilitat <span class='tooltip-skills'>Estic obert a noves idees i disposat a canviar d'enfocament quan sigui necessari.</span>",
    "aprendizajeContinuo": "Capacitat d'aprenentatge continu <span class='tooltip-skills'>Sempre busco aprendre i millorar, ja sigui a través de cursos o experiències.</span>",
    "aprendizajeRapido": "Capacitat d'aprenentatge ràpid <span class='tooltip-skills'>Puc dominar ràpidament noves tecnologies i conceptes.</span>",
    "atencionDetalle": "Atenció al detall <span class='tooltip-skills'>M'asseguro que tots els aspectes del projecte estiguin correctament executats.</span>",
    "pensamientoCritico": "Pensament crític <span class='tooltip-skills'>Avalo i analitzo informació abans de prendre decisions importants.</span>",
    "orientacionResultados": "Orientació a resultats <span class='tooltip-skills'>Em centro en assolir metes i objectius a llarg termini.</span>",
    "resiliencia": "Resiliència <span class='tooltip-skills'>Mantinc un enfocament positiu i continuo, fins i tot davant de reptes.</span>",
    "curiosidad": "Curiositat <span class='tooltip-skills'>Sempre tinc el desig d'explorar nous camps i millorar les meves habilitats.</span>",
    "criticas": "Capacitat per rebre crítiques <span class='tooltip-skills'>Sóc receptiu a la retroalimentació constructiva i l'utilitzo per millorar el rendiment.</span>",
    "proyectosPrincipales": "Projectes Principals",
    "infoProyectosPrincipales": "En aquesta secció es mostren els principals projectes en els quals he treballat; per veure tots els projectes visita la <a href='#' onclick='abrirProyectos()'>pàgina de projectes</a>.",
    "infoPPFichajes": "Desenvolupament d'una plataforma web per al registre dels empleats de Gometrics.",
    "verProyecto": "Veure Projecte",
    "infoPPDR72": "Desenvolupament d'una aplicació Android per connectar-se al manòmetre DR72 i veure les seves dades al mòbil.",
    "infoPPBookPixel": "Desenvolupament d'una aplicació Android per buscar llibres i videojocs per veure la seva informació i marcar-los com a comprats."
}
