{
    "inicio": "Inici",
    "proyectos": "Projectes",
    "about": "Sobre Mi",
    "desarrollo_android": "Desenvolupament Android",
    "desarrollo_web": "Desenvolupament Web",
    "proyectos_python": "Projectes en Python",
    "inteligencia_artificial": "Intel·ligència Artificial",
    "otros": "Altres",
    "cambiar_modo_oscuro": "Canviar a mode fosc",
    "seleccionarIdioma": "Seleccionar idioma",
    "aboutme": "Sóc graduat en Enginyeria Informàtica per la UAB, especialitzat en Enginyeria de Software. Em considero una persona proactiva i apassionada per la programació, sempre enfocada en assolir resultats d'alta qualitat. M'encanta assumir nous reptes, independentment de la tecnologia o el llenguatge, i estic disposat a aprendre qualsevol eina necessària. Al llarg de la meva experiència, he desenvolupat projectes que abasten des d'aplicacions Android fins a pàgines web, sempre amb l'objectiu d'optimitzar el rendiment i la qualitat del codi. La meva motivació diària és millorar i seguir aprenent.",
    "moreInfo": "Si vols més informació sobre mi, visita <a href='pages/sobre-mi.html#about'>sobre mi</a>.",
    "contactar": "Contactar",
    "mail": "Tria com enviar el teu correu",
    "confirmarEnvio": "Confirmar enviament",
    "copiar": "Copiar",
    "mensajeCopiado": "Correu copiat al portapapers!",
    "info": "Enginyer Informàtic, Menció Enginyeria de Software",
    "formacion": "Formació",
    "infoFormacion": "Al llarg de la meva formació he estudiat a: ",
    "moreInfoFormacion": "Si vols més informació sobre la meva formació, visita <a href='pages/sobre-mi.html#formacion'>la meva formació completa</a>.",
    "habilidades": "Habilitats",
    "habilidadesTecnicas": "Habilitats Tècniques",
    "conocimientosBasicos": "Mostrar Coneixements Bàsics",
    "conocimientosCompletos": "Mostrar Coneixements Complets",
    "otrosLenguajes": "Altres Llenguatges",
    "python": "Python (Aplicacions d'escriptori i IA)",
    "lua": "Lua (Scripting embegut)",
    "C": "C (Aplicacions embegudes)",
    "dart": "Dart (Desenvolupament mòbil)",
    "herramientas": "Eines",
    "metodologia": "Metodologia Àgil",
    "otras": "Altres",
    "habilidadesBlandas": "Habilitats toves",
    "trabajoEnEquipo": "Treball en equip <span class='tooltip-skills'>Col·laboro de manera eficient amb altres per assolir objectius comuns.</span>",
    "adaptabilidad": "Adaptabilitat <span class='tooltip-skills'>Sóc capaç d'ajustar estratègies i mètodes de treball en entorns canviants.</span>",
    "resolucionProblemas": "Resolució de problemes <span class='tooltip-skills'>Identifico i soluciono problemes de manera efectiva i creativa.</span>",
    "gestionTiempo": "Gestió del temps <span class='tooltip-skills'>Organitzo i prioritzo tasques per complir amb els terminis establerts.</span>",
    "flexibilidad": "Flexibilitat <span class='tooltip-skills'>Estic obert a noves idees i disposat a canviar d'enfocament quan sigui necessari.</span>",
    "aprendizajeContinuo": "Capacitat d'aprenentatge continu <span class='tooltip-skills'>Sempre busco aprendre i millorar, ja sigui a través de cursos o experiències.</span>",
    "aprendizajeRapido": "Capacitat d'aprenentatge ràpid <span class='tooltip-skills'>Puc dominar ràpidament noves tecnologies i conceptes.</span>",
    "atencionDetalle": "Atenció al detall <span class='tooltip-skills'>M'asseguro que tots els aspectes del projecte estiguin correctament executats.</span>",
    "pensamientoCritico": "Pensament crític <span class='tooltip-skills'>Avalo i analitzo informació abans de prendre decisions importants.</span>",
    "orientacionResultados": "Orientació a resultats <span class='tooltip-skills'>Em centro en assolir metes i objectius a llarg termini.</span>",
    "resiliencia": "Resiliència <span class='tooltip-skills'>Mantinc un enfocament positiu i continuo, fins i tot davant de reptes.</span>",
    "curiosidad": "Curiositat <span class='tooltip-skills'>Sempre tinc el desig d'explorar nous camps i millorar les meves habilitats.</span>",
    "criticas": "Capacitat per rebre crítiques <span class='tooltip-skills'>Sóc receptiu a la retroalimentació constructiva i l'utilitzo per millorar el rendiment.</span>",
    "proyectosPrincipales": "Projectes Principals",
    "infoProyectosPrincipales": "En aquesta secció es mostren els principals projectes en els quals he treballat; per veure tots els projectes visita la <a href='#' onclick='abrirProyectos()'>pàgina de projectes</a>.",
    "infoPPFichajes": "Desenvolupament d'una plataforma web per al registre dels empleats de Gometrics.",
    "verProyecto": "Veure Projecte",
    "infoPPDR72": "Desenvolupament d'una aplicació Android per connectar-se al manòmetre DR72 i veure les seves dades al mòbil.",
    "infoPPBookPixel": "Desenvolupament d'una aplicació Android per buscar llibres i videojocs per veure la seva informació i marcar-los com a comprats.",
    "presentacionAndroid": "A continuació, es presenten alguns dels projectes Android en què he treballat, centrats en el desenvolupament d'aplicacions mòbils utilitzant tecnologies com Java, Firebase i APIs de tercers.",
    "tituloAndroid": "Projectes Android",
    "descripcionFoodFeed": "<strong>Descripció del projecte:</strong> En una assignatura universitària, vaig participar en un projecte en equip per desenvolupar una aplicació Android que, mitjançant intel·ligència artificial, permet als usuaris identificar aliments mitjançant imatges i obtenir informació nutricional, com calories, proteïnes, greixos i carbohidrats, utilitzant APIs de tercers.",
    "rolFoodFeed": "<strong>El meu rol:</strong> Vaig treballar amb tres companys en la implementació del frontend de l'aplicació, utilitzant <strong>Android Studio</strong> i <strong>Java</strong>. Ens vam encarregar de:",
    "tarea1FoodFeed": "Dissenyar i implementar la interfície d'usuari (UI), garantint que fos intuïtiva i fàcil d'usar.",
    "tarea2FoodFeed": "Desenvolupar les diferents pantalles de l'aplicació.",
    "tarea3FoodFeed": "Integrar l'app amb components d'Android, com la càmera per a la presa de fotos dels aliments.",
    "tarea4FoodFeed": "Col·laborar en la integració de l'aplicació amb un backend, utilitzant un webserver per emmagatzemar dades en una base de dades i fer consultes a les APIs utilitzades.",
    "tecnologias": "Tecnologies utilitzades:",
    "lenguajeFoodFeed": "<strong>Llenguatge:</strong> Java",
    "plataformaFoodFeed": "<strong>Plataforma:</strong> Android Studio",
    "colaboracionFoodFeed": "<strong>Col·laboració:</strong> Git per al control de versions i treball en equip.",
    "gestionTareasFoodFeed": "<strong>Gestió de Tasques:</strong> Jira per a la planificació i seguiment de tasques del projecte.",
    "metodologiaFoodFeed": "<strong>Metodologia:</strong> Scrum",
    "apiFoodFeed": "<strong>API:</strong> Food Data Central API",
    "verCapturas": "Veure Captures de Pantalla",
    "modalTitleFoodFeed": "Captures de Pantalla - FoodFeed",
    "pantallaInicioFoodFeed": "Pantalla d'inici, on es pot veure el dia actual, els nutrients consumits i una llista dels aliments consumits.",
    "pantallaEstadisticasFoodFeed": "Pantalla d'estadístiques, on es poden veure el total de nutrients consumits per dia de l'últim dia, setmana, mes o any.",
    "pantalla3FoodFeed": "Pantalla per seleccionar un dia per veure la informació d'aquest dia en particular.",
    "pantalla4FoodFeed": "Pantalla semblant a la d'inici, però amb la informació del dia filtrat des de la pantalla de calendari.",
    "pantalla5FoodFeed": "Pantalla per a cerca per text d'aliments, els últims cercats són els que apareixen per defecte.",
    "pantalla6FoodFeed": "Pantalla per veure els nutrients que conté l'aliment i afegir-ne el consum.",
    "videoError": "El teu navegador no suporta l'etiqueta de vídeo.",
    "videoFoodFeed": "En aquest vídeo es pot veure el banner promocional que es va fer per a l'aplicació.",
    "anterior": "Anterior",
    "siguiente": "Següent",
    "repoFoodFeed": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat. Si es vol accedir al codi, el puc compartir durant una entrevista.",
    "equipoFoodFeed": "<strong>Equip:</strong> Treball en equip amb altres 7 companys, dividits en 2 backend, 2 IA i 4 frontend.",
    "descripcionBookPixel": "<strong>Descripció del projecte:</strong> En una assignatura universitària, vaig participar en un projecte en equip per desenvolupar una aplicació Android que, mitjançant imatge, text o veu, permet als usuaris buscar informació sobre llibres i videojocs, a més d'incloure un chatbot. El projecte va fer ús d'APIs de tercers.",
    "rolBookPixel": "<strong>El meu rol:</strong> Vaig treballar amb dos companys en diverses tasques del desenvolupament, utilitzant <strong>Android Studio</strong>, <strong>Java</strong>, <strong>Node.js</strong>, <strong>Typescript</strong> i <strong>Firebase</strong>. Les meves principals contribucions van ser:",
    "tarea1BookPixel": "Dissenyar i implementar les Cloud Functions en Firebase.",
    "tarea2BookPixel": "Desenvolupar diverses pantalles de l'aplicació, incloent la pantalla principal, les de cerca (imatge, text, veu) i les pantalles de resultats, informació del producte, carretó i post-compra, historial, la llista de desitjos i ajustos per canviar l'idioma.",
    "tarea3BookPixel": "Afegir suport d'internacionalització (i18n) (català, espanyol, anglès, alemany, portuguès, italià, francès, gallec i basc).",
    "tarea4BookPixel": "Integrar components d'Android, com la càmera i micròfon per a les cerques per imatge i veu.",
    "tarea5BookPixel": "Col·laborar amb la integració entre l'aplicació i Firestore i la connexió entre l'app i les Cloud Functions.",
    "tarea6BookPixel": "Investigar, seleccionar i integrar les APIs necessàries.",
    "lenguajesBookPixel": "<strong>Llenguatges:</strong> Java per a l'aplicació i Typescript per a les cloud functions.",
    "plataformasBookPixel": "<strong>Plataformes:</strong> Android Studio, Firebase, Google Cloud i Visual Studio Code.",
    "colaboracionBookPixel": "<strong>Col·laboració:</strong> Git per al control de versions i treball en equip.",
    "apisBookPixel": "<strong>APIs:</strong> Google Books API, RAWG API, Google Traductor API, Google Cloud Vision, Google Cloud Speech API.",
    "capturasBookPixel": "Captures de Pantalla - BookPixel",
    "pantallaInicioClaroBookPixel": "Pantalla d'inici en mode clar, on es poden veure els llibres i videojocs visitats, però no comprats.",
    "pantallaInicioOscuroBookPixel": "Pantalla d'inici en mode fosc, on es poden veure els llibres i videojocs visitats, però no comprats.",
    "pantalla3BookPixel": "Pantalla per seleccionar entre cerca per text, àudio o imatge.",
    "pantalla4BookPixel": "Pantalla per cerca per imatge, on es pot triar si filtrar per llibre (títol o autor) o videojoc (títol) seleccionant imatge de galeria o fent una foto.",
    "pantalla5BookPixel": "Pantalla per cerca per text, on es pot triar filtrar per llibre (títol o autor i idioma) o per videojocs (títol, desenvolupador, gènere o plataformes).",
    "pantalla6BookPixel": "Pantalla per cerca per àudio, on es pot triar filtrar per llibre (títol o autor) o per videojocs (títol o desenvolupador).",
    "pantalla7BookPixel": "Pantalla d'informació del llibre, on es poden veure la portada, l'editorial, autor, títol i la descripció del llibre.",
    "pantalla8BookPixel": "Pantalla d'informació del videojoc, on es poden veure el títol, classificació del videojoc (segons ESRB), nota en RAWG i Metacritic, plataformes, gèneres, data de llançament i descripció del videojoc.",
    "pantalla9BookPixel": "Pantalla d'informació del videojoc, continuació de l'anterior, amb el lloc web oficial, on es pot comprar i l'opció d'afegir el videojoc al carretó.",
    "pantalla10BookPixel": "Pantalla a la qual s'arriba en prémer el botó de metacritic.",
    "pantalla11BookPixel": "Pantalla amb un diagrama circular de valoració feta pels usuaris a RAWG.",
    "pantalla12BookPixel": "Pantalla amb un diagrama de barres de valoració feta pels usuaris a RAWG.",
    "pantalla13BookPixel": "Pantalla del carretó, on es poden veure els llibres i videojocs afegits al carretó, permetent seleccionar-los i marcar-los com a comprats.",
    "pantalla14BookPixel": "Pantalla amb un llistat de llibres visitats i comprats.",
    "pantalla15BookPixel": "Pantalla amb un llistat de videojocs visitats i comprats.",
    "pantalla16BookPixel": "Pantalla per canviar l'idioma de l'aplicació (català, espanyol, anglès, portuguès, italià, francès, alemany, gallec o basc).",
    "pantalla17BookPixel": "Pantalla per veure videojocs que encara no han sortit però han estat afegits a la preselecció, mostrant títol, data de llançament i dies restants.",
    "notaBookPixel": "<strong>Nota:</strong> Les pantalles en mode clar i fosc són gairebé idèntiques, només varia la paleta de colors, com es veu a la pantalla d'inici.",
    "enlaceBookPixel": "<strong>Enllaç al repositori:</strong> El codi es troba en un repositori privat. Si es vol accedir al codi, el puc compartir durant una entrevista.",
    "equipoBookPixel": "<strong>Equip:</strong> Treball en equip amb 2 companys.",
    "descripcionDR72": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament d'una aplicació Android que, mitjançant connectivitat Bluetooth, permet als usuaris visualitzar en format gràfic i textual els valors que llegeix el dispositiu <strong>DR72</strong>, creat per l'empresa.",
    "rolDR72": "<strong>El meu rol:</strong> Vaig treballar principalment de manera individual, amb suport puntual dels desenvolupadors del hardware del DR72 per a la implementació de la connectivitat Bluetooth. Vaig utilitzar <strong>Android Studio</strong> i <strong>Java</strong>. La meva responsabilitat principal va ser desenvolupar l'aplicació completa, des de la interfície d'usuari fins a la comunicació amb el dispositiu. També vaig desenvolupar un servidor web per rebre, emmagatzemar les dades i gestionar la comunicació entre l'app i el servidor.",
    "lenguajeDR72": "<strong>Llenguatge:</strong> Java",
    "plataformaDR72": "<strong>Plataforma:</strong> Android Studio",
    "colaboracionDR72": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "infraestructuraDR72": "<strong>Infraestructura addicional:</strong> Webserver per a la gestió de dades.",
    "enlaceDR72": "<strong>Enllaç al repositori:</strong> El codi es troba en un repositori privat i no pot ser compartit.",
    "enlaceDescargaDR72": "Enllaç per descarregar",
    "equipoDR72": "<strong>Equip:</strong> Treball individual, amb petites col·laboracions dels desenvolupadors del hardware per a la connectivitat.",
    "capturasDR72": "Captures de Pantalla - Appdr72",
    "pantalla1DR72": "Pantalla d'inici en mode clar.",
    "pantalla2DR72": "Pantalla per cercar i connectar amb el dispositiu DR72.",
    "pantalla3DR72": "Pantalla d'inici en mode fosc.",
    "pantalla4DR72": "Pantalla per consultar dades de connexions anteriors, permetent cercar per qualsevol data o per una en concret.",
    "pantalla5DR72": "Pantalla on es poden veure les dades que va llegint el DR72.",
    "pantalla6DR72": "Pantalla on es poden veure les dades que va llegint el DR72 en format gràfic.",
    "notaDR72": "<strong>Nota:</strong> Les pantalles en mode clar i fosc són gairebé idèntiques, només varia la paleta de colors, com es veu a la pantalla d'inici.",
    "tituloIA": "Projectes d'IA",
    "presentacionIA": "A continuació es presenten alguns dels projectes d'aprenentatge automàtic en què he treballat, centrats en el desenvolupament d'intel·ligències artificials predictives mitjançant tecnologies com Python i Jupyter Notebook.",
    "bibliotecasUsadas": "Biblioteques Utilitzades",
    "descripcionSpaceshipTitanic": "<strong>Descripció del Projecte:</strong> En un curs universitari, vaig participar en un projecte individual en forma de <strong>datathon</strong>, on vam tenir 3 dies per resoldre un problema de classificació d'una competició de Kaggle, utilitzant les dades d'aquest <a href='https://www.kaggle.com/competitions/spaceship-titanic/overview'>enllaç</a>.",
    "rolSpaceshipTitanic": "<strong>El meu Rol:</strong> Vaig treballar de manera individual per resoldre el problema i classificar-me el més alt possible, utilitzant <strong>Jupyter Notebook</strong> i <strong>Python</strong>. La meva responsabilitat principal va ser analitzar les dades i crear un model predictiu amb la màxima precisió possible.",
    "lenguajeSpaceshipTitanic": "<strong>Llenguatges:</strong> Python",
    "plataformaSpaceshipTitanic": "<strong>Plataformes:</strong> Jupyter Notebook, Kaggle per descarregar conjunts de dades i enviar solucions.",
    "colaboracionSpaceshipTitanic": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "bibliotecasUsadasProyecto": "Biblioteques utilitzades:",
    "pandasProyectos": "<strong>Pandas:</strong> Utilitzat per gestionar diversos arxius d'Excel.",
    "numpyProyectos": "<strong>NumPy:</strong> Utilitzat per processar dades de diferents arxius d'Excel.",
    "matplotlibSpaceshipTitanic": "<strong>Matplotlib:</strong> Utilitzat per dibuixar gràfics a partir de les dades processades dels arxius d'Excel.",
    "sklearnProyectos": "<strong>Sklearn:</strong> Utilitzat per processar les dades, com la gestió de dades mancants, l'estandardització de les característiques, la reducció de la dimensionalitat i la divisió eficient del conjunt de dades en conjunts d'entrenament i prova.",
    "warningsProyectos": "<strong>Warnings:</strong> Utilitzat per evitar missatges de 'Future Warning'.",
    "enlaceSpaceshipTitanic": "<strong>Enllaç del repositori:</strong> El codi està emmagatzemat en un repositori privat. Si vols accedir-hi, el puc compartir durant una entrevista.",
    "equipoSpaceshipTitanic": "<strong>Equip:</strong> Treball individual.",
    "resultadosSpaceshipTitanic": "<strong>Resultats:</strong> Amb el model entrenat utilitzant el model SVM, es va aconseguir un resultat de 0.77507.",
    "descripcionF1": "<strong>Descripció del Projecte:</strong> En un curs universitari, vaig treballar en un projecte individual on vaig crear dos models per predir quants cotxes acabaran una cursa i una cursa de sprints a la Fórmula 1, utilitzant les dades d'aquest <a href='https://www.kaggle.com/datasets/rohanrao/formula-1-world-championship-1950-2020'>enllaç</a>.",
    "rolF1": "<strong>El meu Rol:</strong> Vaig treballar de manera individual per resoldre el problema, utilitzant <strong>Jupyter Notebook</strong> i <strong>Python</strong>. La meva responsabilitat principal va ser fusionar les dades de dos conjunts de dades, analitzar-les i crear dos models predictius (un per a les curses de sprint i un per a les curses normals) amb la màxima precisió possible.",
    "lenguajesF1": "<strong>Llenguatges:</strong> Python",
    "plataformasF1": "<strong>Plataformes:</strong> Jupyter Notebook, Kaggle per descarregar conjunts de dades i enviar solucions.",
    "colaboracionF1": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "matplotlibF1": "<strong>Matplotlib:</strong> Utilitzat per dibuixar gràfics a partir de les dades processades d'Excel.",
    "seabornF1": "<strong>Seaborn:</strong> Utilitzat per gràfics estadístics de nivell alt per a l'anàlisi exploratòria de les dades.",
    "foliumF1": "<strong>Folium:</strong> Utilitzat per crear un mapa mostrant les localitzacions dels circuits dels conjunts de dades.",
    "enlaceF1": "<strong>Enllaç del repositori:</strong> El codi està emmagatzemat en un repositori privat. Si vols accedir-hi, el puc compartir durant una entrevista.",
    "equipoF1": "<strong>Equip:</strong> Treball individual.",
    "resultadosF1": "<strong>Resultats:</strong> Amb els models entrenats utilitzant Gradient Boosting, es va realitzar una <strong>validació creuada</strong> per ambdós models, i es va observar que hi havia <strong>sobreajustament</strong>. Tot i que es va mitigar mitjançant <strong>Recursive Feature Elimination (RFE)</strong>, algunes parts del sobreajustament encara persistien.",
    "informeF1": "<strong>Informe del Projecte:</strong> Es va crear un informe detallat per la presentació del projecte. Puc compartir-lo a petició.",
    "pandas": "Biblioteca per a la manipulació i l'anàlisi de dades. Ofereix estructures de dades flexibles i eines per netejar, transformar i visualitzar dades.",
    "numpy": "Biblioteca fonamental per al càlcul científic en Python, que ofereix suport per a matrius i operacions matemàtiques d'alt rendiment.",
    "matplotlib": "Biblioteca per a crear visualitzacions estàtiques, animades i interactives. Ideal per a gràfics d'alta qualitat.",
    "sklearn": "Biblioteca per a l'aprenentatge automàtic, que proporciona eines eficients per a la classificació, la regressió, el clustering i la reducció de la dimensionalitat. Inclou funcions per al pre-processament de dades, selecció de models, optimització de paràmetres i avaluació de rendiment.",
    "warnings": "Biblioteca estàndard per gestionar advertències. S'utilitza sovint per suprimir missatges d'advertència que poden no ser necessaris.",
    "seaborn": "Biblioteca per a la visualització de dades basada en matplotlib. Ofereix gràfics estadístics de nivell alt i és fàcil d'utilitzar per a l'anàlisi exploratòria de les dades (EDA).",
    "folium": "Biblioteca per crear mapes interactius, basada en Leaflet.js. S'utilitza habitualment per a la visualització de dades geoespacials.",
    "tituloOtros": "Altres Projectes",
    "introOtros": "A continuació es presenten altres tipus de projectes en què he treballat en el meu temps lliure.",
    "descripcionFM24": "<strong>Descripció del Projecte:</strong> En el meu temps lliure, m'agrada jugar a Football Manager 2024, i vaig decidir personalitzar la skin per defecte, basada en la skin <a href='https://www.fmscout.com/a-opz-elite-fm24-skin.html' title='Projecte base de la skin'>OpzElite</a>. Després de fer-ho servir, vaig identificar alguns aspectes que volia millorar, així que vaig decidir editar-la. A més, vaig crear imatges personalitzades per a certs jugadors de futbol.",
    "rolFM24": "<strong>El meu Rol:</strong> Vaig treballar amb un amic en l'edició d'aquesta skin, utilitzant <strong>Visual Studio Code</strong> i <strong>XML</strong>. Les meves responsabilitats van ser:",
    "cambiar_colores": {
        "introduccion": "Canviar els colors de certes parts per a fer-los més intuïtius. Per exemple:",
        "mensajes_buzon": "Canviar el color dels missatges llegits per diferenciar clarament entre missatges llegits i no llegits.",
        "valoraciones": "Canviar el color de les valoracions: vermell per a les valoracions baixes i diferents tonalitats de verd per a les millors.",
        "jugadores_cedidos": "Canviar el color dels jugadors cedits al club per fer-los més destacats.",
        "preseleccion": "Canviar el color dels jugadors en la preselecció."
    },
    "añadir_campos": {
        "intro": "Afegir nous camps a certes pantalles del joc. Per exemple:",
        "estrellas": "Afegir les estrelles de les valoracions als jugadors.",
        "recomendacion": "Afegir una recomanació per signar jugadors.",
        "reputacion": "Afegir la reputació del jugador a la secció de 'Traits'."
    },
    "tarea3FM24": "Vaig eliminar enllaços a altres mods a la secció de notícies.",
    "tarea4FM24": "Buscar a internet imatges de futbolistes/entrenadors, editar-les per treure el fons i adaptar-les a una mida adequada per al joc. Encara que hi ha packs que ja ho fan, vaig decidir fer-ho pel meu compte per incloure només les imatges dels jugadors que jo volia, a causa de les limitacions d'espai al meu ordinador, ja que aquests packs solen ocupar molt espai.",
    "tarea5FM24": "Incorporar les imatges mitjançant XML al joc.",
    "imagenesFM24": "<strong>Imatges abans i després de les meves modificacions:</strong>",
    "comparacionAntesDespues": "Veure Comparacions Abans i Després",
    "tituloComparacionFM24": "Comparació Abans i Després Skin FM24",
    "imagen1AntesFM24": "<strong>Abans:</strong> Les valoracions dels jugadors estaven en diversos tons de vermell.",
    "imagen1DespuesFM24": "<strong>Després:</strong> Les valoracions dels jugadors s'han canviat a tons de verd per millorar la comprensió.",
    "imagen2AntesFM24": "<strong>Abans:</strong> Els missatges llegits estaven en color gris i no es distingien bé.",
    "imagen2DespuesFM24": "<strong>Després:</strong> Els missatges llegits es mostren en un color clar per a facilitar la distinció.",
    "imagen3AntesFM24": "<strong>Abans:</strong> Els jugadors cedits al club no estaven ben destacats.",
    "imagen3DespuesFM24": "<strong>Després:</strong> Els jugadors cedits tenen un color destacat per facilitar la identificació.",
    "imagen4AntesFM24": "<strong>Abans:</strong> Aquesta pantalla no mostrava la recomanació per signar un jugador.",
    "imagen4DespuesFM24": "<strong>Després:</strong> S'ha afegit una recomanació per signar un jugador.",
    "imagen5AntesFM24": "<strong>Abans:</strong> El color dels jugadors en la preselecció era vermell.",
    "imagen5DespuesFM24": "<strong>Després:</strong> El color dels jugadors en la preselecció s'ha canviat a groc.",
    "imagen6AntesFM24": "<strong>Abans:</strong> Les valoracions dels atributs estaven en diversos tons de vermell.",
    "imagen6DespuesFM24": "<strong>Després:</strong> Els atributs s'han ajustat per coincidir amb la skin original, i la reputació del jugador s'ha afegit a la secció de 'Player Traits'.",
    "imagen7AntesFM24": "<strong>Abans:</strong> Una fila d'altres modificacions, com ara cares i logos, es mostrava a la secció de notícies.",
    "imagen7DespuesFM24": "<strong>Després:</strong> Aquesta fila s'ha eliminat i totes les notícies es mostren juntes.",
    "notaFM24": "<strong>Nota:</strong> La comparació d'imatges mostra l'estat abans i després de la modificació.",
    "lenguajeFM24": "<strong>Llenguatge:</strong> XML",
    "plataformaFM24": "<strong>Plataforma:</strong> Visual Studio Code",
    "colaboracionFM24": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "repoFM24": "<strong>Enllaç del repositori:</strong> El codi està emmagatzemat en un <a href='https://github.com/J1570841/SkinFM24' title='Repositori privat de la skin FM24'>repositori privat</a>. Pots sol·licitar l'accés per veure el codi.",
    "equipoFM24": "<strong>Equip:</strong> Treball en equip amb un amic.",
    "tituloPython": "Projectes Python",
    "introPython": "A continuació, es presenten alguns dels projectes Python en què he treballat, centrats en el desenvolupament d'aplicacions d'escriptori.",
    "descripcionARTIST": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament d'una aplicació d'escriptori que, amb uns dades d'entrada i un màxim de 10 arxius Excel, generava un informe per als clients.",
    "rolARTIST": "<strong>El meu rol:</strong> Vaig treballar de manera individual, utilitzant <strong>Python</strong>.",
    "lenguajeARTIST": "<strong>Llenguatge:</strong> Python",
    "plataformaARTIST": "<strong>Plataforma:</strong> Visual Studio Code",
    "colaboracionARTIST": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "matplotlibARTIST": "<strong>Matplotlib:</strong> Utilitzada per dibuixar gràfics a partir de les dades processades dels arxius Excel.",
    "pillowARTIST": "<strong>Pillow (PIL):</strong> Utilitzada per convertir imatges a PNG.",
    "pythonDocxARTIST": "<strong>python-docx:</strong> Utilitzada per crear l'informe en un document Word.",
    "tkinterARTIST": "<strong>Tkinter:</strong> Utilitzada per crear la interfície gràfica.",
    "tkcalendarARTIST": "<strong>tkcalendar:</strong> Utilitzada per afegir un calendari a la interfície gràfica.",
    "fakerARTIST": "<strong>Faker:</strong> Utilitzada per generar dades falses durant les proves.",
    "unittestARTIST": "<strong>unittest:</strong> Utilitzada per realitzar proves unitàries.",
    "jsonARTIST": "<strong>json:</strong> Utilitzada per llegir i escriure en arxius JSON.",
    "enlaceARTIST": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no es pot compartir.",
    "equipoARTIST": "<strong>Equip:</strong> Treball individual.",
    "pillow": "Biblioteca per a la manipulació d'imatges en Python, que permet obrir, modificar i desar imatges.",
    "pythonDocx": "Biblioteca per crear i modificar documents de Word en Python, útil per automatitzar informes.",
    "tkinter": "Biblioteca per crear interfícies gràfiques d'usuari (GUIs) en Python, facilitant el desenvolupament d'aplicacions d'escriptori.",
    "tkcalendar": "Biblioteca per afegir calendaris a aplicacions Tkinter, útil per seleccionar dates de manera visual.",
    "faker": "Biblioteca per generar dades fictícies, molt útil per a proves i desenvolupament.",
    "unittest": "Mòdul per realitzar proves unitàries en Python, ajudant a garantir la qualitat del codi.",
    "json": "Mòdul per treballar amb dades en format JSON, permetent la serialització i deserialització de dades.",
    "formacionCompleta": "La Meva Formació Completa",
    "experiencia": "Experiència Professional",
    "colaborarConmigo": "Si t'agradaria col·laborar o tens alguna pregunta, no dubtis a <a href='#' onclick='openModal()'>posar-te en contacte amb mi</a>!",
    "grado": "Grau en Enginyeria Informàtica, Menció Enginyeria del Software - UAB",
    "notaMedia": "Nota mitjana final: 7.19",
    "añosEstudio": "Anys d'estudi: Setembre 2019 - Juliol 2024",
    "infoEstudios": "Durant els meus estudis, he desenvolupat diverses aplicacions Android, com ara <a href='android.html#foodfeed'>FoodFeed</a> i <a href='android.html#bookpixel'>BookPixel</a>, així com programes d'<a href='ia.html'>intel·ligència artificial</a>.",
    "idiomas": "Idiomes",
    "cursoIngles": "<strong>Cursos d'Anglès</strong> - Cambridge School",
    "cursoInglesA2": "Nivell A2<em>(Setembre 2016 - Juny 2017)</em>",
    "cursoInglesB1": "Nivell B1<em>(Setembre 2017 - Juny 2018)</em>",
    "cursoItaliano": "<strong>Curs Virtual d'Italià</strong> - Servei de Llengües UAB, plataforma Dexway",
    "cursoItalianoA1": "Nivell A1/A2 <em>(Abril 2023 - Abril 2024)</em>",
    "puesto": "Lloc: ",
    "puestoMango": "Mosso de Magatzem <em>(Juliol 2022 - Setembre 2022)</em>",
    "infoMango": "Durant el meu temps a Mango, vaig participar en l'empaquetat de productes penjats. La feina consistia en tres tasques possibles:",
    "tareaMango1": "Empaquetar la roba per al seu posterior enviament.",
    "tareaMango2": "Comprovar que les penjadors no s'unissin, per evitar errors en la cadena de transport de la fàbrica.",
    "tareaMango3": "Vigilar que la roba no caigués a terra a la cadena de transport de la fàbrica.",
    "aptitudesMango": "Gràcies a aquestes experiències, tot i que no va ser una feina directament relacionada amb la informàtica, vaig adquirir diverses habilitats importants que considero valuoses, com ara:",
    "aptitudMango1": "<strong>Treball en equip</strong>, col·laborant en cadena per a l'empaquetament de productes penjats.",
    "aptitudMango2": "<strong>Adaptabilitat i flexibilitat</strong>, participant en diferents fases del procés d'empaquetament.",
    "aptitudMango3": "<strong>Atenció al detall</strong>, per assegurar que no es produïssin errors que afectessin el flux de treball.",
    "aptitudMango4": "<strong>Capacitat d'aprenentatge ràpid</strong>, ja que vaig aprendre ràpidament tots els processos i protocols necessaris per dur a terme les meves funcions a l'equip.",
    "puestos": "Llocs:",
    "puestoGometrics1": "Becari IT <em>(Juny 2023 - Setembre 2024)</em>",
    "puestoGometrics2": "Enginyer de Software Junior <em>(Setembre 2024 - )</em>",
    "infoGometrics": "Durant el meu temps a Gometrics, vaig participar en diversos projectes que inclouen diferents plataformes, com ara <a href='web.html'>desenvolupament web</a>, <a href='android.html#appdr72'>aplicacions Android</a> i <a href='python.html#artist'>aplicacions d'escriptori</a>.",
    "aptitudesGometrics": "Gràcies a aquestes experiències, he adquirit diverses habilitats importants, com ara:",
    "aptitudGometrics1": "<strong>Resolució de problemes</strong>, afrontant i resolent desafiaments tècnics en projectes complexos.",
    "aptitudGometrics2": "<strong>Adaptabilitat i flexibilitat</strong>, treballant en diferents projectes de diverses plataformes.",
    "aptitudGometrics3": "<strong>Gestió del temps</strong>, per complir terminis i organitzar múltiples tasques dins dels projectes.",
    "aptitudGometrics4": "<strong>Orientació a resultats</strong>, mantenint-me enfocat en assolir els objectius i terminis establerts.",
    "aptitudGometrics5": "<strong>Pensament crític</strong>, analitzant problemes des de diferents perspectives abans de prendre decisions.",
    "proyectoWeb": "Projecte Web",
    "introWeb": "A continuació, es presenten alguns dels projectes Web en què he treballat, centrats en el desenvolupament de pàgines web.",
    "fichajes": "Fitxatges",
    "mejoras": "Millores",
    "mrp": "Integració MRP-ERP",
    "tituloFichajes": "Fitxatges - Sistema de Control Horari",
    "descripcionFichajes": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament d’una plataforma web per fitxar les entrades i sortides dels treballadors.",
    "rolFichajes": "<strong>El meu rol:</strong> Vaig treballar juntament amb un altre company en la implementació del frontend i el backend de l’aplicació, utilitzant <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong> i <strong>PHPMyAdmin</strong> per a la base de dades <strong>MySQL</strong>. Ens vam encarregar de:",
    "tareaFichajes1": "Dissenyar i implementar la interfície d’usuari (UI), garantint que fos intuïtiva i fàcil d’utilitzar.",
    "tareaFichajes2": "Desenvolupar les diferents pantalles de la plataforma web.",
    "tareaFichajes3": "Crear una API per facilitar el desenvolupament d’una webapp per a dispositius mòbils.",
    "tareaFichajes4": "Realitzar proves sobre les pantalles i el sistema complet.",
    "tareasFichajes5": "Desenvolupar una webapp per a dispositius mòbils.",
    "lenguajesFichajes": "<strong>Llenguatges:</strong> HTML, CSS, JavaScript, PHP",
    "BDFichajes": "<strong>Plataforma de base de dades:</strong> PHPMyAdmin",
    "colaboracionFichajes": "<strong>Col·laboració:</strong> Git per al control de versions i treball en equip, assegurant la integració contínua sense conflictes.",
    "GtareasFichajes": "<strong>Gestió de Tasques:</strong> Jira i Leantime per a la planificació i seguiment de tasques del projecte.",
    "metodologiaFichajes": "<strong>Metodologia:</strong> Scrumban",
    "enlaceFichajes": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no pot ser compartit.",
    "equipoFichajes": "<strong>Equip:</strong> Treball en equip amb un altre company.",
    "tituloMejoras": "Millores ERP",
    "descripcionMejoras": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament de millores per a diversos mòduls del <strong>sistema ERP</strong> de l’empresa, millorant-ne el rendiment, optimitzant alguns mòduls i afegint noves funcionalitats.",
    "rolMejoras": "<strong>El meu rol:</strong> Vaig treballar principalment de manera individual, utilitzant <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong> i <strong>PHPMyAdmin</strong> per a la base de dades <strong>MySQL</strong>. Les meves responsabilitats principals van ser:",
    "tareaMejoras1": "Complir amb les tasques assignades, assegurant la correcta implementació i funcionalitat de les millores.",
    "tareaMejoras2": "Realitzar proves per garantir que els mòduls optimitzats funcionessin correctament.",
    "lenguajesMejoras": "<strong>Llenguatges:</strong> HTML, CSS, JavaScript, PHP",
    "BDMejoras": "<strong>Plataforma de base de dades:</strong> PHPMyAdmin",
    "colaboracionMejoras": "<strong>Col·laboració:</strong> Git per al control de versions.",
    "gTareasMejoras": "<strong>Gestió de Tasques:</strong> Jira i Leantime per a la planificació i seguiment de tasques del projecte.",
    "metodologiaMejoras": "<strong>Metodologia:</strong> Scrumban",
    "enlaceMejoras": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no pot ser compartit.",
    "equipoMejoras": "<strong>Equip:</strong> Treball individual.",
    "descripcionBeamex": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament d’una <strong>automatització</strong> per a la generació del document <strong>MC6 i MC6-Ex Order Form</strong> de <strong class='tooltip-beamex'>Beamex <span class='tooltiptext'>Beamex és una empresa que ofereix solucions de calibració per a indústries.</span></strong>, optimitzant el procés a partir d’una compra per generar un PDF amb les dades corresponents emplenades, eliminant errors manuals i accelerant el flux de treball.",
    "rolBeamex": "<strong>El meu rol:</strong> Vaig treballar juntament amb un altre company en el desenvolupament complet d’aquesta automatització, utilitzant <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong> i <strong>PHP</strong>. La meva responsabilitat va ser:",
    "tarea1Beamex": "Vaig ser responsable del <strong>desenvolupament complet</strong> de l’estructura del document en PDF, a partir del document Word proporcionat per Beamex.",
    "tarea2Beamex": "Vaig desenvolupar la <strong>lògica de negoci</strong> per emplenar automàticament el formulari amb les dades de la compra, assegurant que la informació es processés correctament.",
    "tarea3Beamex": "Realitzar proves per garantir que funciona correctament.",
    "lenguajesBeamex": "<strong>Llenguatges:</strong> HTML, CSS, JavaScript, PHP",
    "colaboracionBeamex": "<strong>Col·laboració:</strong> Git per al control de versions i treball en equip.",
    "gTareasBeamex": "<strong>Gestió de Tasques:</strong> Jira per a la planificació i seguiment de tasques del projecte.",
    "repoBeamex": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no pot ser compartit.",
    "equipoBeamex": "<strong>Equip:</strong> Treball en equip amb un altre company.",
    "tituloMRP": "Integració MRP-ERP",
    "descripcionMRP": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en l’anàlisi i el desenvolupament d’un nou <strong>MRP</strong> integrat a l’ERP de l’empresa, per substituir l’MRP que s’utilitzava.",
    "rolMRP": "<strong>El meu rol: </strong> Vaig treballar juntament amb un altre company en l’anàlisi i el desenvolupament d’aquest projecte, utilitzant <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong> i <strong>PHP</strong>. La meva responsabilitat va ser:",
    "tareaMRP1": "Analitzar les funcionalitats de l’MRP anterior i consultar amb els usuaris per identificar-ne les necessitats i requisits.",
    "tareaMRP2": "Relacionar les taules de dades de l’MRP anterior amb la seva funcionalitat, ja que no es tenia accés al codi font. Això és necessari per poder importar les dades al nou MRP i que es visualitzin correctament a les pantalles desenvolupades.",
    "tareaMRP3": "Desenvolupar les diferents pantalles que es van integrar a l’ERP per a l’MRP.",
    "lenguajesMRP": "<strong>Llenguatges:</strong> HTML, CSS, JavaScript, PHP",
    "BDMRP": "<strong>Plataforma de base de dades:</strong> PHPMyAdmin",
    "colaboracionMRP": "<strong>Col·laboració:</strong> Git per al control de versions i treball en equip.",
    "gTareasMRP": "<strong>Gestió de Tasques:</strong> Jira per a la planificació i seguiment de tasques del projecte.",
    "repoMRP": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no pot ser compartit.",
    "equipoMRP": "<strong>Equip:</strong> Treball en equip amb un altre company.",
    "proyectos_java": "Projectes en Java",
    "tituloJava": "Projectes Java",
    "introJava": "A continuació, es presenten alguns dels projectes Java en què he treballat, centrats en el desenvolupament d'aplicacions d'escriptori.",
    "migracion": "Migració",
    "tituloMigracion": "Migració App RTM",
    "descripcionMigracion": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en la migració d'una aplicació d'escriptori dissenyada per a <strong>Raspberry Pi</strong>, actualitzant la seva base tecnològica de <strong>Java 8</strong> a <strong>Java 11</strong> i reescrivint la interfície d'usuari de <strong>Swing</strong> a <strong>JavaFX</strong>, millorant el seu rendiment, manteniment i adaptabilitat a noves tecnologies.",
    "rolMigracion": "<strong>El meu rol:</strong> Vaig treballar juntament amb un altre company en la implementació del frontend i el backend de l'aplicació, utilitzant <strong>Java</strong>, <strong>CSS</strong> i <strong>FXML</strong>. Les meves tasques principals van ser:",
    "tareaMigracion1": "Reescriure la interfície d'usuari de Swing a JavaFX",
    "tareaMigracion2": "Corregir possibles errors que sorgissin com a resultat de la migració",
    "tareaMigracion3": "Comprovar el correcte funcionament de l'aplicació en Raspberry Pi",
    "lenguajesMigracion": "<strong>Llenguatges:</strong> Java, CSS, FXML",
    "colaboracionMigracion": "<strong>Col·laboració:</strong> Tortoise SVN per al control de versions i treball en equip, assegurant la integració contínua sense conflictes.",
    "enlaceMigracion": "<strong>Enllaç al repositori:</strong> El codi està emmagatzemat en un repositori privat i no pot ser compartit.",
    "equipoMigracion": "<strong>Equip:</strong> Treball en equip amb un altre company.",
    "sceneBuilder": "Scene Builder (Dissenyador UI JavaFX)",
    "javaLenguaje": "Java (Android Studio i Aplicacions d'escriptori)",
    "descripcionLogiReception": "<strong>Descripció del projecte:</strong> A <strong>Gometrics</strong>, vaig participar en el desenvolupament d'una aplicació Android que permet als usuaris del departament de logística de l'empresa pujar imatges dels albarans d'entrada i sortida a una carpeta de xarxa privada.",
    "rolLogiReception": "<strong>El meu rol:</strong> Vaig treballar de manera individual. Vaig utilitzar <strong>Android Studio</strong> i <strong>Java</strong>. La meva responsabilitat principal va ser desenvolupar tota l'aplicació, des de la interfície d'usuari fins a la comunicació amb la carpeta de xarxa.",
    "equipoLogiReception": "<strong>Equip:</strong> Treball individual.",
    "capturasLogiReception": "Captures de Pantalla - LogiReception",
    "pantalla2LogiReception": "Pantalla per fer una foto i pujar-la a la xarxa",
    "pantalla4LogiReception": "Pantalla amb imatges que encara no s'han pujat a la carpeta de xarxa",
    "pantalla5LogiReception": "Modal per introduir el nom del client (és el nom amb què es guardarà la carpeta a la xarxa)",
    "pantalla6LogiReception": "Pujant les imatges a la carpeta de xarxa",
    "pantalla7LogiReception": "Error en la pujada de les imatges",
    "pantalla8LogiReception": "Algunes imatges pujades i altres amb error"
}
