{
    "inicio": "Home",
    "proyectos": "Projects",
    "about": "About Me",
    "desarrollo_android": "Android Development",
    "desarrollo_web": "Web Development",
    "proyectos_python": "Python Projects",
    "inteligencia_artificial": "Artificial Intelligence",
    "otros": "Others",
    "cambiar_modo_oscuro": "Switch to Dark Mode",
    "seleccionarIdioma": "Select Language",
    "aboutme": "I am a graduate in Computer Engineering from UAB, specializing in Software Engineering. I consider myself a proactive person passionate about programming, always focused on achieving high-quality results. I love taking on new challenges, regardless of technology or language, and I am willing to learn any tool necessary. Throughout my experience, I have developed projects ranging from Android applications to websites, always aiming to optimize performance and code quality. My daily motivation is to improve and keep learning.",
    "moreInfo": "If you want more information about me, visit <a href='src/pages/sobre-mi.html#about'>about me</a>.",
    "contactar": "Contact",
    "mail": "Choose how to send your email",
    "confirmarEnvio": "Confirm Send",
    "copiar": "Copy",
    "mensajeCopiado": "Email copied to clipboard!",
    "info": "Computer Engineer, Software Engineering Specialization",
    "formacion": "Education",
    "infoFormacion": "Throughout my education I have studied at: ",
    "moreInfoFormacion": "If you want more information about my education, visit <a href='src/pages/sobre-mi.html#formacion'>my complete education</a>.",
    "habilidades": "Skills",
    "habilidadesTecnicas": "Technical Skills",
    "conocimientosBasicos": "Show Basic Knowledge",
    "conocimientosCompletos": "Show Complete Knowledge",
    "otrosLenguajes": "Other Languages",
    "python": "Python (Desktop Applications and AI)",
    "lua": "Lua (Embedded Scripting)",
    "C": "C (Embedded Applications)",
    "dart": "Dart (Mobile Development)",
    "herramientas": "Tools",
    "metodologia": "Agile Methodology",
    "otras": "Others",
    "habilidadesBlandas": "Soft Skills",
    "trabajoEnEquipo": "Teamwork <span class='tooltip-skills'>I collaborate effectively with others to achieve common goals.</span>",
    "adaptabilidad": "Adaptability <span class='tooltip-skills'>I can adjust strategies and working methods in changing environments.</span>",
    "resolucionProblemas": "Problem Solving <span class='tooltip-skills'>I identify and solve problems effectively and creatively.</span>",
    "gestionTiempo": "Time Management <span class='tooltip-skills'>I organize and prioritize tasks to meet deadlines.</span>",
    "flexibilidad": "Flexibility <span class='tooltip-skills'>I am open to new ideas and willing to change approach when necessary.</span>",
    "aprendizajeContinuo": "Continuous Learning <span class='tooltip-skills'>I always seek to learn and improve, whether through courses or experiences.</span>",
    "aprendizajeRapido": "Quick Learning <span class='tooltip-skills'>I can quickly master new technologies and concepts.</span>",
    "atencionDetalle": "Attention to Detail <span class='tooltip-skills'>I ensure all aspects of the project are correctly executed.</span>",
    "pensamientoCritico": "Critical Thinking <span class='tooltip-skills'>I evaluate and analyze information before making important decisions.</span>",
    "orientacionResultados": "Results-Oriented <span class='tooltip-skills'>I focus on achieving long-term goals and objectives.</span>",
    "resiliencia": "Resilience <span class='tooltip-skills'>I maintain a positive focus and keep going, even in the face of challenges.</span>",
    "curiosidad": "Curiosity <span class='tooltip-skills'>I always have the desire to explore new fields and improve my skills.</span>",
    "criticas": "Ability to Receive Criticism <span class='tooltip-skills'>I am receptive to constructive feedback and use it to improve performance.</span>",
    "proyectosPrincipales": "Main Projects",
    "infoProyectosPrincipales": "This section shows the main projects I have worked on; to see all projects visit the <a href='#' onclick='abrirProyectos()'>projects page</a>.",
    "infoPPFichajes": "Development of a web platform for employee time tracking at Gometrics.",
    "verProyecto": "View Project",
    "infoPPDR72": "Development of an Android application to connect with the DR72 pressure gauge and view its data on mobile.",
    "infoPPBookPixel": "Development of an Android application to search for books and video games, view their information, and mark them as purchased.",
    "presentacionAndroid": "Here are some of the Android projects I have worked on, focused on mobile application development using technologies such as Java, Firebase, and third-party APIs.",
    "tituloAndroid": "Android Projects",
    "descripcionFoodFeed": "<strong>Project description:</strong> As part of a university course, I participated in a team project to develop an Android application that, through artificial intelligence, allows users to identify foods using images and obtain nutritional information such as calories, proteins, fats, and carbohydrates, using third-party APIs.",
    "rolFoodFeed": "<strong>My role:</strong> I worked with three teammates in implementing the frontend of the application, using <strong>Android Studio</strong> and <strong>Java</strong>. We were responsible for:",
    "tarea1FoodFeed": "Designing and implementing the user interface (UI), ensuring it was intuitive and user-friendly.",
    "tarea2FoodFeed": "Developing the various screens of the application.",
    "tarea3FoodFeed": "Integrating the app with Android components, such as the camera for capturing food images.",
    "tarea4FoodFeed": "Collaborating on the integration of the application with a backend, using a web server to store data in a database and to make requests to the APIs we used.",
    "tecnologias": "Technologies used:",
    "lenguajeFoodFeed": "<strong>Language:</strong> Java",
    "plataformaFoodFeed": "<strong>Platform:</strong> Android Studio",
    "colaboracionFoodFeed": "<strong>Collaboration:</strong> Git for version control and teamwork.",
    "gestionTareasFoodFeed": "<strong>Task Management:</strong> Jira for project planning and task tracking.",
    "metodologiaFoodFeed": "<strong>Methodology:</strong> Scrum",
    "apiFoodFeed": "<strong>API:</strong> Food Data Central API",
    "verCapturas": "View Screenshots",
    "modalTitleFoodFeed": "Screenshots - FoodFeed",
    "pantallaInicioFoodFeed": "Home screen, where you can see the current day, nutrients consumed, and a list of foods consumed.",
    "pantallaEstadisticasFoodFeed": "Statistics screen, where you can view the total nutrients consumed by day for the last day, week, month, or year.",
    "pantalla3FoodFeed": "Screen for selecting a day to view the information for that specific day.",
    "pantalla4FoodFeed": "Screen similar to the home screen but with filtered day information from the calendar screen.",
    "pantalla5FoodFeed": "Screen for text search of foods, with recently searched items appearing by default.",
    "pantalla6FoodFeed": "Screen for viewing the nutrients in a food item and adding how much has been consumed.",
    "videoError": "Your browser does not support the video tag.",
    "videoFoodFeed": "In this video, you can see the promotional banner created for the application.",
    "anterior": "Previous",
    "siguiente": "Next",
    "repoFoodFeed": "<strong>Repository link:</strong> The code is stored in a private repository. If access to the code is required, I can share it during an interview.",
    "equipoFoodFeed": "<strong>Team:</strong> Teamwork with 7 other colleagues, divided into 2 backend, 2 AI, and 4 frontend developers.",
    "descripcionBookPixel": "<strong>Project description:</strong> As part of a university course, I participated in a team project to develop an Android application that, using image, text, or voice, allows users to search for information on books and video games, as well as including a chatbot. The project made use of third-party APIs.",
    "rolBookPixel": "<strong>My role:</strong> I worked alongside two colleagues on various development tasks, using <strong>Android Studio</strong>, <strong>Java</strong>, <strong>Node.js</strong>, <strong>Typescript</strong>, and <strong>Firebase</strong>. My main contributions were:",
    "tarea1BookPixel": "Designing and implementing Cloud Functions in Firebase.",
    "tarea2BookPixel": "Developing various screens for the app, including the main screen, search screens (image, text, voice), and result screens, product info, cart and post-purchase, history, wishlist, and settings to change the language.",
    "tarea3BookPixel": "Adding support for internationalization (i18n) (Spanish, English, German, Portuguese, Italian, Catalan, French, Galician, Basque).",
    "tarea4BookPixel": "Integrating Android components like the camera and microphone for image and voice search.",
    "tarea5BookPixel": "Collaborating on the integration between the app and Firestore, as well as the connection between the app and Cloud Functions.",
    "tarea6BookPixel": "Researching, selecting, and integrating the necessary APIs.",
    "lenguajesBookPixel": "<strong>Languages:</strong> Java for the app and Typescript for the cloud functions.",
    "plataformasBookPixel": "<strong>Platforms:</strong> Android Studio, Firebase, Google Cloud, and Visual Studio Code.",
    "colaboracionBookPixel": "<strong>Collaboration:</strong> Git for version control and teamwork.",
    "apisBookPixel": "<strong>APIs:</strong> Google Books API, RAWG API, Google Translate API, Google Cloud Vision, Google Cloud Speech API.",
    "capturasBookPixel": "Screenshots - BookPixel",
    "pantallaInicioClaroBookPixel": "Light mode homepage, where you can see books and video games you have visited but not purchased.",
    "pantallaInicioOscuroBookPixel": "Dark mode homepage, where you can see books and video games you have visited but not purchased.",
    "pantalla3BookPixel": "Screen to choose between search by text, audio, or image.",
    "pantalla4BookPixel": "Image search screen, where you can choose to filter by book (title or author) or video game (title) by selecting an image from the gallery or taking a photo.",
    "pantalla5BookPixel": "Text search screen, where you can filter by book (title or author and language) or video games (title, developer, genre, or platforms).",
    "pantalla6BookPixel": "Audio search screen, where you can filter by book (title or author) or video game (title or developer).",
    "pantalla7BookPixel": "Book information screen, where you can see the cover, publisher, author, title, and book description.",
    "pantalla8BookPixel": "Video game information screen, where you can see the title, video game rating (according to ESRB), score on RAWG and Metacritic, platforms, genres, release date, and description.",
    "pantalla9BookPixel": "Video game information screen, continuation of the previous one, showing the official website, where you can buy it and the option to add it to the cart.",
    "pantalla10BookPixel": "Screen reached by clicking the Metacritic button.",
    "pantalla11BookPixel": "Screen showing a pie chart of user ratings on RAWG.",
    "pantalla12BookPixel": "Screen showing a bar chart of user ratings on RAWG.",
    "pantalla13BookPixel": "Cart screen, where you can see a list of books and video games added to the cart, allowing you to select them and mark them as purchased.",
    "pantalla14BookPixel": "Screen showing a list of visited and purchased books.",
    "pantalla15BookPixel": "Screen showing a list of visited and purchased video games.",
    "pantalla16BookPixel": "Screen to change the language in which the app is displayed (Spanish, English, Portuguese, Italian, Catalan, French, German, Galician, or Basque).",
    "pantalla17BookPixel": "Screen showing video games that haven't been released yet but have been added to a preselection, displaying the title, release date, and days left until release.",
    "notaBookPixel": "<strong>Note:</strong> The light and dark mode screens are almost identical, with only the color palette changing, as seen on the homepage.",
    "enlaceBookPixel": "<strong>Link to repository:</strong> The code is stored in a private repository. If you would like access to it, I can share it during an interview.",
    "equipoBookPixel": "<strong>Team:</strong> Teamwork with 2 colleagues.",
    "descripcionDR72": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I participated in the development of an Android app that, through Bluetooth connectivity, allows users to view graphically and textually the values read by the <strong>DR72</strong> device created by the company.",
    "rolDR72": "<strong>My role:</strong> I mainly worked individually, with occasional support from the DR72 hardware developers for Bluetooth connectivity implementation. I used <strong>Android Studio</strong> and <strong>Java</strong>. My main responsibility was developing the entire app, from the user interface to communication with the device. Additionally, I developed a web server to receive and store data and manage communication between the app and the server.",
    "lenguajeDR72": "<strong>Language:</strong> Java",
    "plataformaDR72": "<strong>Platform:</strong> Android Studio",
    "colaboracionDR72": "<strong>Collaboration:</strong> Git for version control.",
    "infraestructuraDR72": "<strong>Additional infrastructure:</strong> Webserver for data management.",
    "enlaceDR72": "<strong>Link to repository:</strong> The code is stored in a private repository and cannot be shared.",
    "enlaceDescargaDR72": "Download link",
    "equipoDR72": "<strong>Team:</strong> Individual work, with small collaborations from the hardware developers for connectivity.",
    "capturasDR72": "Screenshots - Appdr72",
    "pantalla1DR72": "Light mode homepage.",
    "pantalla2DR72": "Screen to search and connect with the DR72 device.",
    "pantalla3DR72": "Dark mode homepage.",
    "pantalla4DR72": "Screen to view previous connection data, allowing searches by any date or specific one.",
    "pantalla5DR72": "Screen to view the data read by the DR72.",
    "pantalla6DR72": "Screen to view the data read by the DR72 in a graphical format.",
    "notaDR72": "<strong>Note:</strong> The light and dark mode screens are almost identical, with only the color palette changing, as seen on the homepage.",
    "tituloIA": "AI Projects",
    "presentacionIA": "Below are some of the machine learning projects I've worked on, focused on developing predictive artificial intelligences using technologies such as Python and Jupyter Notebook.",
    "bibliotecasUsadas": "Libraries Used",
    "descripcionSpaceshipTitanic": "<strong>Project Description:</strong> In a university course, I participated in an individual project in the form of a <strong>datathon</strong>, where we had 3 days to solve a classification problem from a Kaggle competition, using the data from this <a href='https://www.kaggle.com/competitions/spaceship-titanic/overview'>link</a>.",
    "rolSpaceshipTitanic": "<strong>My Role:</strong> I worked individually to solve the problem and rank as high as possible, using <strong>Jupyter Notebook</strong> and <strong>Python</strong>. My main responsibility was to analyze the data and create a predictive model with the highest accuracy possible.",
    "lenguajeSpaceshipTitanic": "<strong>Languages:</strong> Python",
    "plataformaSpaceshipTitanic": "<strong>Platforms:</strong> Jupyter Notebook, Kaggle to download datasets and submit solutions.",
    "colaboracionSpaceshipTitanic": "<strong>Collaboration:</strong> Git for version control.",
    "bibliotecasUsadasProyecto": "Libraries used:",
    "pandasProyectos": "<strong>Pandas:</strong> Used for handling various Excel files.",
    "numpyProyectos": "<strong>NumPy:</strong> Used for processing data from different Excel files.",
    "matplotlibSpaceshipTitanic": "<strong>Matplotlib:</strong> Used to plot graphs from the data processed from the Excel files.",
    "sklearnProyectos": "<strong>Sklearn:</strong> Used for processing data, such as handling missing data, standardizing features, reducing dimensionality, and efficiently splitting the dataset into training and test sets.",
    "warningsProyectos": "<strong>Warnings:</strong> Used to prevent 'Future Warning' messages.",
    "enlaceSpaceshipTitanic": "<strong>Repository Link:</strong> The code is stored in a private repository. If you would like access, I can share it during an interview.",
    "equipoSpaceshipTitanic": "<strong>Team:</strong> Individual work.",
    "resultadosSpaceshipTitanic": "<strong>Results:</strong> With the model trained using the SVM model, a score of 0.77507 was achieved.",
    "descripcionF1": "<strong>Project Description:</strong> In a university course, I worked on an individual project where I created two models to predict how many cars would finish a race and a sprint race in Formula 1, using the data from this <a href='https://www.kaggle.com/datasets/rohanrao/formula-1-world-championship-1950-2020'>link</a>.",
    "rolF1": "<strong>My Role:</strong> I worked individually to solve the problem, using <strong>Jupyter Notebook</strong> and <strong>Python</strong>. My main responsibility was to merge the data from two datasets, analyze the data, and create two predictive models (one for sprint races and one for regular races) with the highest accuracy possible.",
    "lenguajesF1": "<strong>Languages:</strong> Python",
    "plataformasF1": "<strong>Platforms:</strong> Jupyter Notebook, Kaggle to download datasets and submit solutions.",
    "colaboracionF1": "<strong>Collaboration:</strong> Git for version control.",
    "matplotlibF1": "<strong>Matplotlib:</strong> Used to draw graphs from the processed Excel data.",
    "seabornF1": "<strong>Seaborn:</strong> Used for high-level statistical graphs for exploratory data analysis.",
    "foliumF1": "<strong>Folium:</strong> Used to create a map showing the locations of the circuits from the datasets.",
    "enlaceF1": "<strong>Repository Link:</strong> The code is stored in a private repository. If you would like access, I can share it during an interview.",
    "equipoF1": "<strong>Team:</strong> Individual work.",
    "resultadosF1": "<strong>Results:</strong> With the models trained using Gradient Boosting, a <strong>cross-validation</strong> was performed for both models, and it was observed that there was <strong>overfitting</strong>. Although it was mitigated using <strong>Recursive Feature Elimination (RFE)</strong>, some overfitting remained.",
    "informeF1": "<strong>Project Report:</strong> A detailed report was created for project submission. I can share it upon request.",
    "pandas": "Library for data manipulation and analysis. It provides flexible data structures and tools for cleaning, transforming, and visualizing data.",
    "numpy": "Fundamental library for scientific computing in Python, offering support for matrices and high-performance mathematical operations.",
    "matplotlib": "Library for creating static, animated, and interactive visualizations. Ideal for high-quality graphs.",
    "sklearn": "Library for machine learning, providing efficient tools for classification, regression, clustering, and dimensionality reduction. It includes functions for data preprocessing, model selection, hyperparameter optimization, and performance evaluation.",
    "warnings": "Standard library for managing warnings. It is often used to suppress warning messages that may be unnecessary.",
    "seaborn": "Library for data visualization based on matplotlib. It provides high-level statistical graphics and is easy to use for exploratory data analysis (EDA).",
    "folium": "Library for creating interactive maps, based on Leaflet.js. Commonly used for geospatial data visualization.",
    "tituloOtros": "Other Projects",
    "introOtros": "Below are other types of projects I've worked on in my spare time.",
    "descripcionFM24": "<strong>Project Description:</strong> In my spare time, I enjoy playing Football Manager 2024, and I decided to customize the default skin, based on the <a href='https://www.fmscout.com/a-opz-elite-fm24-skin.html' title='Base Project for the skin'>OpzElite</a> skin. After using it, I identified some aspects that I wanted to improve, so I decided to edit it. Additionally, I created custom images for certain football players.",
    "rolFM24": "<strong>My Role:</strong> I worked with a friend on editing this skin, using <strong>Visual Studio Code</strong> and <strong>XML</strong>. My responsibilities included:",
    "cambiar_colores": {
        "introduccion": "Changing the colors of certain parts to more intuitive ones. For example:",
        "mensajes_buzon": "Changing the color of inbox messages to differentiate clearly between read and unread messages.",
        "valoraciones": "Changing the color of ratings: red for low ratings and various shades of green for the best ones.",
        "jugadores_cedidos": "Changing the color of loaned players to/from the club to make them stand out more.",
        "preseleccion": "Changing the color of players in the pre-selection."
    },
    "añadir_campos": {
        "intro": "Adding new fields to certain game screens. For example:",
        "estrellas": "Adding current and potential quality stars to the player preview carousel, showing their foot strength, representative, qualities, and my added stars.",
        "reputacion": "Adding the player's reputation to the 'Player Traits' box on the player’s general view.",
        "recomendacion": "Adding a recommendation to sign a player in the scouting overview."
    },
    "tarea3FM24": "I removed links to other mods in the news section.",
    "tarea4FM24": "I searched for football player/coach images on the internet, edited them to remove backgrounds, and resized them appropriately for the game. While some packs already do this, I decided to do it myself to include only the images I wanted, due to limited PC storage as these packs take up a lot of space.",
    "tarea5FM24": "Incorporating images into the game using XML.",
    "imagenesFM24": "<strong>Images before and after my modifications:</strong>",
    "comparacionAntesDespues": "See Before and After Comparisons",
    "tituloComparacionFM24": "Before and After Skin FM24 Comparison",
    "imagen1AntesFM24": "<strong>Before:</strong> The color of the read messages was white, and under certain lighting, it was hard to distinguish between read and unread messages.",
    "imagen1DespuesFM24": "<strong>After:</strong> The color of the read messages was changed to blue to solve the issue mentioned earlier.",
    "imagen2AntesFM24": "<strong>Before:</strong> The colors for loaned players (to/from the club) were different shades of blue, but depending on the lighting, they were hard to tell apart.",
    "imagen2DespuesFM24": "<strong>After:</strong> The color for loaned players going to another club was changed to lilac to make them stand out clearly.",
    "imagen3AntesFM24": "<strong>Before:</strong> Training ratings were in red, and the best ratings were in different shades of red.",
    "imagen3DespuesFM24": "<strong>After:</strong> The best training ratings are now green, with various shades of green.",
    "imagen4AntesFM24": "<strong>Before:</strong> This screen did not display the recommendation to sign a player.",
    "imagen4DespuesFM24": "<strong>After:</strong> A recommendation to sign a player has been added to the view.",
    "imagen5AntesFM24": "<strong>Before:</strong> The pre-selection player color was red.",
    "imagen5DespuesFM24": "<strong>After:</strong> The pre-selection player color was changed to yellow to match the original game skin.",
    "imagen6AntesFM24": "<strong>Before:</strong> Attribute colors were various shades of red.",
    "imagen6DespuesFM24": "<strong>After:</strong> Attribute colors have been adjusted to match the original game skin, and the player's reputation has been added in the 'Player Traits'.",
    "imagen7AntesFM24": "<strong>Before:</strong> A row of other mods such as faces and logos was displayed in the news section.",
    "imagen7DespuesFM24": "<strong>After:</strong> This row has been removed, and all news items are now displayed together.",
    "notaFM24": "<strong>Note:</strong> The image comparison shows the state before and after the modification.",
    "lenguajeFM24": "<strong>Language:</strong> XML",
    "plataformaFM24": "<strong>Platform:</strong> Visual Studio Code",
    "colaboracionFM24": "<strong>Collaboration:</strong> Git for version control.",
    "repoFM24": "<strong>Repository Link:</strong> The code is stored in a <a href='https://github.com/J1570841/SkinFM24' title='Private FM24 Skin Repository'>private repository</a>. You can request access to view the code.",
    "equipoFM24": "<strong>Team:</strong> Teamwork with a friend.",
    "tituloPython": "Python Projects",
    "introPython": "Below are some of the Python projects I have worked on, focused on desktop application development.",
    "descripcionARTIST": "<strong>Project Description:</strong> At <strong>Gometrics</strong>, I participated in the development of a desktop application that, with input data and a maximum of 10 Excel files, generated a report for the clients.",
    "rolARTIST": "<strong>My role:</strong> I worked individually, using <strong>Python</strong>.",
    "lenguajeARTIST": "<strong>Language:</strong> Python",
    "plataformaARTIST": "<strong>Platform:</strong> Visual Studio Code",
    "colaboracionARTIST": "<strong>Collaboration:</strong> Git for version control.",
    "matplotlibARTIST": "<strong>Matplotlib:</strong> Used to draw graphs from the processed data in the Excel files.",
    "pillowARTIST": "<strong>Pillow (PIL):</strong> Used to convert images to PNG.",
    "pythonDocxARTIST": "<strong>python-docx:</strong> Used to generate the report in a Word document.",
    "tkinterARTIST": "<strong>Tkinter:</strong> Used to create the graphical user interface.",
    "tkcalendarARTIST": "<strong>tkcalendar:</strong> Used to add a calendar to the graphical interface.",
    "fakerARTIST": "<strong>Faker:</strong> Used to generate fake data for testing purposes.",
    "unittestARTIST": "<strong>unittest:</strong> Used for unit testing.",
    "jsonARTIST": "<strong>json:</strong> Used to read and write JSON files.",
    "enlaceARTIST": "<strong>Link to the repository:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoARTIST": "<strong>Team:</strong> Individual work.",
    "pillow": "Library for image manipulation in Python, allowing you to open, modify, and save images.",
    "pythonDocx": "Library for creating and modifying Word documents in Python, useful for automating reports.",
    "tkinter": "Library for creating graphical user interfaces (GUIs) in Python, facilitating desktop application development.",
    "tkcalendar": "Library for adding calendars to Tkinter applications, useful for visually selecting dates.",
    "faker": "Library for generating fake data, very useful for testing and development.",
    "unittest": "Module for running unit tests in Python, helping to ensure code quality.",
    "json": "Module for working with JSON data, allowing serialization and deserialization of data.",
    "formacionCompleta": "My Complete Training",
    "experiencia": "Professional Experience",
    "colaborarConmigo": "If you would like to collaborate or have any questions, don’t hesitate to <a href='#' onclick='openModal()'>get in touch with me</a>!",
    "grado": "Bachelor’s Degree in Computer Engineering, Software Engineering Specialization - UAB",
    "notaMedia": "Final average grade: 7.19",
    "añosEstudio": "Years of study: September 2019 - July 2024",
    "infoEstudios": "During my studies, I developed various Android applications, such as <a href='android.html#foodfeed'>FoodFeed</a> and <a href='android.html#bookpixel'>BookPixel</a>, as well as <a href='ia.html'>artificial intelligence</a> programs.",
    "idiomas": "Languages",
    "cursoIngles": "<strong>English Courses</strong> - Cambridge School",
    "cursoInglesA2": "Level A2<em>(September 2016 - June 2017)</em>",
    "cursoInglesB1": "Level B1<em>(September 2017 - June 2018)</em>",
    "cursoItaliano": "<strong>Virtual Italian Course</strong> - UAB Language Service, Dexway platform",
    "cursoItalianoA1": "Level A1/A2 <em>(April 2023 - April 2024)</em>",
    "puesto": "Position: ",
    "puestoMango": "Warehouse Worker <em>(July 2022 - September 2022)</em>",
    "infoMango": "During my time at Mango, I participated in the packaging of hanging products. The job involved three possible tasks:",
    "tareaMango1": "Packing clothes for later shipment.",
    "tareaMango2": "Checking that hangers were not stuck together to avoid issues in the factory’s conveyor chain.",
    "tareaMango3": "Ensuring clothes didn’t fall to the ground on the factory’s conveyor chain.",
    "aptitudesMango": "Thanks to these experiences, even though it was not a job directly related to computer science, I gained several important skills that I consider valuable, such as:",
    "aptitudMango1": "<strong>Teamwork</strong>, by collaborating in the chain to package hanging products.",
    "aptitudMango2": "<strong>Adaptability and flexibility</strong>, by participating in different phases of the packaging process.",
    "aptitudMango3": "<strong>Attention to detail</strong>, to ensure no errors occurred that could disrupt the workflow.",
    "aptitudMango4": "<strong>Quick learning ability</strong>, as I quickly learned all the necessary processes and protocols to perform my tasks in the team.",
    "puestos": "Positions:",
    "puestoGometrics1": "IT Intern <em>(June 2023 - September 2024)</em>",
    "puestoGometrics2": "Junior Software Engineer <em>(September 2024 - Present)</em>",
    "infoGometrics": "During my time at Gometrics, I participated in various projects spanning different platforms, including <a href='web.html'>web development</a>, <a href='android.html#appdr72'>Android applications</a>, and <a href='python.html#artist'>desktop applications</a>.",
    "aptitudesGometrics": "Thanks to these experiences, I have acquired several important skills, such as:",
    "aptitudGometrics1": "<strong>Problem-solving</strong>, by tackling and resolving technical challenges in complex projects.",
    "aptitudGometrics2": "<strong>Adaptability and flexibility</strong>, by working on different projects across various platforms.",
    "aptitudGometrics3": "<strong>Time management</strong>, to meet deadlines and organize multiple tasks within projects.",
    "aptitudGometrics4": "<strong>Results-oriented mindset</strong>, staying focused on achieving established goals and deadlines.",
    "aptitudGometrics5": "<strong>Critical thinking</strong>, by analyzing problems from different perspectives before making decisions.",
    "proyectoWeb": "Web Project",
    "introWeb": "Below are some of the web projects I have worked on, focusing on web page development.",
    "fichajes": "Time Tracking",
    "mejoras": "Improvements",
    "mrp": "MRP-ERP Integration",
    "tituloFichajes": "Time Tracking - Time Control System",
    "descripcionFichajes": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I participated in the development of a web platform for tracking employees' clock-ins and clock-outs.",
    "rolFichajes": "<strong>My role:</strong> I worked alongside another colleague to implement the frontend and backend of the application using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong>, and <strong>PHPMyAdmin</strong> for the <strong>MySQL</strong> database. We were responsible for:",
    "tareaFichajes1": "Designing and implementing the user interface (UI), ensuring it was intuitive and user-friendly.",
    "tareaFichajes2": "Developing the various screens of the web platform.",
    "tareaFichajes3": "Creating an API to facilitate the development of a mobile web app.",
    "tareaFichajes4": "Performing tests on the screens and the entire system.",
    "tareasFichajes5": "Developing a mobile web app.",
    "lenguajesFichajes": "<strong>Languages:</strong> HTML, CSS, JavaScript, PHP",
    "BDFichajes": "<strong>Database platform:</strong> PHPMyAdmin",
    "colaboracionFichajes": "<strong>Collaboration:</strong> Git for version control and team collaboration, ensuring continuous integration without conflicts.",
    "GtareasFichajes": "<strong>Task Management:</strong> Jira and Leantime for project task planning and tracking.",
    "metodologiaFichajes": "<strong>Methodology:</strong> Scrumban",
    "enlaceFichajes": "<strong>Repository link:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoFichajes": "<strong>Team:</strong> Teamwork with another colleague.",
    "tituloMejoras": "ERP Improvements",
    "descripcionMejoras": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I participated in the development of enhancements for various modules of the company's <strong>ERP system</strong>, improving performance, optimizing some modules, and adding new functionalities.",
    "rolMejoras": "<strong>My role:</strong> I primarily worked individually, using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong>, and <strong>PHPMyAdmin</strong> for the <strong>MySQL</strong> database. My main responsibilities were:",
    "tareaMejoras1": "Completing assigned tasks, ensuring proper implementation and functionality of the improvements.",
    "tareaMejoras2": "Testing to ensure the optimized modules worked correctly.",
    "lenguajesMejoras": "<strong>Languages:</strong> HTML, CSS, JavaScript, PHP",
    "BDMejoras": "<strong>Database platform:</strong> PHPMyAdmin",
    "colaboracionMejoras": "<strong>Collaboration:</strong> Git for version control.",
    "gTareasMejoras": "<strong>Task Management:</strong> Jira and Leantime for project task planning and tracking.",
    "metodologiaMejoras": "<strong>Methodology:</strong> Scrumban",
    "enlaceMejoras": "<strong>Repository link:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoMejoras": "<strong>Team:</strong> Individual work.",
    "descripcionBeamex": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I participated in the development of an <strong>automation</strong> to generate the <strong>MC6 and MC6-Ex Order Form</strong> document for <strong class='tooltip-beamex'>Beamex <span class='tooltiptext'>Beamex is a company offering calibration solutions for industries.</span></strong>, optimizing the process from a purchase to generate a PDF with the corresponding data filled in, eliminating manual errors and accelerating workflow.",
    "rolBeamex": "<strong>My role:</strong> I worked alongside another colleague on the complete development of this automation using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and <strong>PHP</strong>. My responsibility was:",
    "tarea1Beamex": "I was responsible for the <strong>complete development</strong> of the PDF document structure based on the Word document provided by Beamex.",
    "tarea2Beamex": "I developed the <strong>business logic</strong> to automatically fill the form with the purchase data, ensuring the information was processed correctly.",
    "tarea3Beamex": "Performing tests to ensure proper functionality.",
    "lenguajesBeamex": "<strong>Languages:</strong> HTML, CSS, JavaScript, PHP",
    "colaboracionBeamex": "<strong>Collaboration:</strong> Git for version control and team collaboration.",
    "gTareasBeamex": "<strong>Task Management:</strong> Jira for project task planning and tracking.",
    "repoBeamex": "<strong>Repository link:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoBeamex": "<strong>Team:</strong> Teamwork with another colleague.",
    "tituloMRP": "MRP-ERP Integration",
    "descripcionMRP": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I participated in the analysis and development of a new <strong>MRP</strong> integrated into the company's ERP to replace the existing MRP.",
    "rolMRP": "<strong>My role:</strong> I worked alongside another colleague on the analysis and development of this project using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and <strong>PHP</strong>. My responsibility was:",
    "tareaMRP1": "Analyzing the functionalities of the previous MRP and consulting with users to identify their needs and requirements.",
    "tareaMRP2": "Mapping the data tables from the previous MRP to their functionality, as the source code was not available. This was necessary to import the data into the new MRP and ensure they were displayed correctly on the developed screens.",
    "tareaMRP3": "Developing the various screens integrated into the ERP for the MRP.",
    "lenguajesMRP": "<strong>Languages:</strong> HTML, CSS, JavaScript, PHP",
    "BDMRP": "<strong>Database platform:</strong> PHPMyAdmin",
    "colaboracionMRP": "<strong>Collaboration:</strong> Git for version control and team collaboration.",
    "gTareasMRP": "<strong>Task Management:</strong> Jira for project task planning and tracking.",
    "repoMRP": "<strong>Repository link:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoMRP": "<strong>Team:</strong> Teamwork with another colleague.",
    "proyectos_java": "Java Projects",
    "tituloJava": "Java Projects",
    "introJava": "Below are some of the Java projects I have worked on, focusing on desktop application development.",
    "migracion": "Migration",
    "tituloMigracion": "RTM App Migration",
    "descripcionMigracion": "<strong>Project Description:</strong> At <strong>Gometrics</strong>, I participated in the migration of a desktop application designed for <strong>Raspberry Pi</strong>, updating its technological base from <strong>Java 8</strong> to <strong>Java 11</strong> and rewriting the user interface from <strong>Swing</strong> to <strong>JavaFX</strong>, improving its performance, maintainability, and adaptability to new technologies.",
    "rolMigracion": "<strong>My Role:</strong> I worked alongside a colleague on the implementation of the application's frontend and backend, using <strong>Java</strong>, <strong>CSS</strong>, and <strong>FXML</strong>. My main tasks were:",
    "tareaMigracion1": "Rewriting the user interface from Swing to JavaFX",
    "tareaMigracion2": "Fixing possible errors that arose as a result of the migration",
    "tareaMigracion3": "Ensuring the correct operation of the application on Raspberry Pi",
    "lenguajesMigracion": "<strong>Languages:</strong> Java, CSS, FXML",
    "colaboracionMigracion": "<strong>Collaboration:</strong> Tortoise SVN for version control and teamwork, ensuring continuous integration without conflicts.",
    "enlaceMigracion": "<strong>Repository Link:</strong> The code is stored in a private repository and cannot be shared.",
    "equipoMigracion": "<strong>Team:</strong> Teamwork with another colleague.",
    "sceneBuilder": "Scene Builder (JavaFX UI Designer)",
    "javaLenguaje": "Java (Android Studio and Desktop Applications)",
    "descripcionLogiReception": "<strong>Project Description:</strong> At <strong>Gometrics</strong>, I participated in the development of an Android application that allows users from the company's logistics department to upload images of entry and exit delivery notes to a private network folder.",
    "rolLogiReception": "<strong>My Role:</strong> I worked individually. I used <strong>Android Studio</strong> and <strong>Java</strong>. My main responsibility was to develop the entire application, from the user interface to communication with the network folder.",
    "equipoLogiReception": "<strong>Team:</strong> Individual work.",
    "capturasLogiReception": "Screenshots - LogiReception",
    "pantalla2LogiReception": "Screen to take a photo for uploading to the network",
    "pantalla4LogiReception": "Screen showing images that have not yet been uploaded to the network folder",
    "pantalla5LogiReception": "Modal to enter the client's name (this will be the name under which the folder is saved on the network)",
    "pantalla6LogiReception": "Uploading images to the network folder",
    "pantalla7LogiReception": "Error uploading images",
    "pantalla8LogiReception": "Some images uploaded and others failed",
    "descripcionBackup": "<strong>Project description:</strong> At <strong>Gometrics</strong>, I contributed to developing a feature for a desktop application to upload and download data to and from a server database.",
    "rolBackup": "<strong>My role:</strong> I worked independently using <strong>Java</strong>. My main tasks were:",
    "tareaBackup1": "Adapt the local database for integration with a server database",
    "tareaBackup2": "Develop the data synchronization functionality (upload and download)",
    "tareaBackup3": "Ensure proper functionality through thorough testing",
    "lenguajesBackup": "<strong>Languages:</strong>Java",
    "puestoGometrics3": "Computer Systems Validation Technician <em>(June 2025 – Present)</em>",
    "puestoGometrics4": "IT Support Technician <em>(June 2025 – Present)</em>",
    "aptitudGometrics6": "<strong>Software validation</strong>, gaining a deep understanding of validation processes in regulated environments, such as the pharmaceutical sector."
}
