{
    "inicio": "Inicio",
    "proyectos": "Proyectos",
    "about": "Sobre Mí",
    "desarrollo_android": "Desarrollo Android",
    "desarrollo_web": "Desarrollo Web",
    "proyectos_python": "Proyectos en Python",
    "inteligencia_artificial": "Inteligencia Artificial",
    "otros": "Otros",
    "cambiar_modo_oscuro": "Cambiar a modo oscuro",
    "seleccionarIdioma": "Seleccionar idioma",
    "aboutme": "Soy graduado en Ingeniería Informática por la UAB, especializado en Ingeniería del Software. Me considero una persona proactiva y apasionada por la programación, siempre enfocada en alcanzar resultados de alta calidad. Me encanta asumir nuevos retos, independientemente de la tecnología o el lenguaje, y estoy dispuesto a aprender cualquier herramienta que sea necesaria. A lo largo de mi experiencia, he desarrollado proyectos que abarcan desde aplicaciones android hasta páginas web, siempre con el objetivo de optimizar el rendimiento y la calidad del código. Mi motivación diaria es mejorar y seguir aprendiendo.",
    "moreInfo": "Si quieres más información sobre mí, visita <a href='pages/sobre-mi.html#about'>sobre mí</a>.",
    "contactar": "Contactar",
    "mail": "Elige cómo enviar tu correo",
    "confirmarEnvio": "Confirmar envío",
    "copiar": "Copiar",
    "mensajeCopiado": "¡Correo copiado al portapapeles!",
    "info": "Ingeniero Informático, Mención Ingenieria del Software",
    "formacion": "Formación",
    "infoFormacion": "A lo largo de mi formación he estudiado en: ",
    "moreInfoFormacion": "Si quieres más información sobre mi formación, visita <a href='pages/sobre-mi.html#formacion'>mi formación completa</a>.",
    "habilidades": "Habilidades",
    "habilidadesTecnicas": "Habilidades Técnicas",
    "conocimientosBasicos": "Mostrar Conocimientos Básicos",
    "conocimientosCompletos": "Mostrar Conocimientos Completos",
    "otrosLenguajes": "Otros Lenguajes",
    "python": "Python (Aplicaciones de escritorio y IA",
    "lua": "Lua (Scripting embebido)",
    "C": "C (Aplicaciones embebidas)",
    "dart": "Dart (Desarrollo móvil)",
    "herramientas": "Herramientas",
    "metodologia": "Metodología Ágil",
    "otras": "Otras",
    "habilidadesBlandas": "Habilidades Blandas",
    "trabajoEnEquipo": "Trabajo en equipo <span class='tooltip-skills'>Colaboro de manera eficiente con otros para alcanzar objetivos comunes.</span>",
    "adaptabilidad": "Adaptabilidad <span class='tooltip-skills'>Soy capaz de ajustar estrategias y métodos de trabajo en entornos cambiantes.</span>",
    "resolucionProblemas": "Resolución de problemas <span class='tooltip-skills'>Identifico y soluciono problemas de manera efectiva y creativa.</span>",
    "gestionTiempo": "Gestión del tiempo <span class='tooltip-skills'>Organizo y priorizo tareas para cumplir con plazos establecidos.</span>",
    "flexibilidad": "Flexibilidad <span class='tooltip-skills'>Estoy abierto a nuevas ideas y dispuesto a cambiar de enfoque cuando sea necesario.</span>",
    "aprendizajeContinuo": "Capacidad de aprendizaje continuo <span class='tooltip-skills'>Siempre busco aprender y mejorar, ya sea a través de cursos o experiencias.</span>",
    "aprendizajeRapido": "Capacidad de aprendizaje rápido <span class='tooltip-skills'>Puedo dominar rápidamente nuevas tecnologías y conceptos.</span>",
    "atencionDetalle": "Atención al detalle <span class='tooltip-skills'>Me aseguro de que todos los aspectos del proyecto estén correctamente ejecutados.</span>",
    "pensamientoCritico": "Pensamiento crítico <span class='tooltip-skills'>Evalúo y analizo información antes de tomar decisiones importantes.</span>",
    "orientacionResultados": "Orientación a resultados <span class='tooltip-skills'>Me enfoco en alcanzar metas y objetivos a largo plazo.</span>",
    "resiliencia": "Resiliencia <span class='tooltip-skills'>Mantengo un enfoque positivo y sigo adelante, incluso frente a desafíos.</span>",
    "curiosidad": "Curiosidad <span class='tooltip-skills'>Siempre tengo el deseo de explorar nuevos campos y mejorar mis habilidades.</span>",
    "criticas": "Capacidad para recibir críticas <span class='tooltip-skills'>Soy receptivo a la retroalimentación constructiva y la utilizo para mejorar el desempeño.</span>",
    "proyectosPrincipales": "Proyectos Principales",
    "infoProyectosPrincipales": "En esta sección se muestran los principales proyectos en los que he trabajado, para ver todos los proyectos visite la <a href='#' onclick='abrirProyectos()'>página de proyectos</a>.",
    "infoPPFichajes": "Desarrollo de una plataforma web para los fichajes de los empleados de Gometrics.",
    "verProyecto": "Ver Proyecto",
    "infoPPDR72": "Desarrollo de aplicación Android para conectar con el manómetro DR72 y ver sus datos en el móbil.",
    "infoPPBookPixel": "Desarrollo de aplicación Android para buscar libros y videojuegos para ver su información y marcarlos como comprados.",
    "presentacionAndroid": "A continuación, se presentan algunos de los proyectos Android en los que he trabajado, centrados en el desarrollo de aplicaciones móviles utilizando tecnologías como Java, Firebase y APIs de terceros.",
    "tituloAndroid" : "Proyectos Android",
    "descripcionFoodFeed": "<strong>Descripción del proyecto:</strong> En una asignatura universitaria, participé en un proyecto en equipo para desarrollar una aplicación Android que, a través de inteligencia artificial, permite a los usuarios identificar alimentos mediante imágenes y obtener información nutricional, como calorías, proteínas, grasas y carbohidratos, utilizando APIs de terceros.",
    "rolFoodFeed": "<strong>Mi rol:</strong> Trabajé junto a tres compañeros en la implementación del frontend de la aplicación, utilizando <strong>Android Studio</strong> y <strong>Java</strong>. Nos encargamos de:",
    "tarea1FoodFeed": "Diseñar e implementar la interfaz de usuario (UI), garantizando que fuera intuitiva y fácil de usar.",
    "tarea2FoodFeed": "Desarrollar las distintas pantallas de la aplicación.",
    "tarea3FoodFeed": "Integrar la app con componentes de Android, como la cámara para la toma de fotos de los alimentos.",
    "tarea4FoodFeed": "Colaborar en la integración de la aplicación con un backend, utilizando un webserver para almacenar datos en una base de datos y realizar consultas a las APIs que utilizamos.",
    "tecnologias": "Tecnologías usadas:",
    "lenguajeFoodFeed": "<strong>Lenguaje:</strong> Java",
    "plataformaFoodFeed": "<strong>Plataforma:</strong> Android Studio",
    "colaboracionFoodFeed": "<strong>Colaboración:</strong> Git para control de versiones y trabajo en equipo.",
    "gestionTareasFoodFeed": "<strong>Gestión de Tareas:</strong> Jira para la planificación y seguimiento de tareas del proyecto.",
    "metodologiaFoodFeed": "<strong>Metodología:</strong> Scrum",
    "apiFoodFeed": "<strong>API:</strong> Food Data Central API",
    "verCapturas": "Ver Capturas de Pantalla",
    "modalTitleFoodFeed": "Capturas de Pantalla - FoodFeed",
    "pantallaInicioFoodFeed": "Pantalla de inicio, dónde se puede ver el día actual, los nutrientes consumidos y una lista de los alimentos consumidos.",
    "pantallaEstadisticasFoodFeed": "Pantalla de estadísticas, dónde puedes ver el total de nutrientes consumidos y por día del último dia, semana, mes o año.",
    "pantalla3FoodFeed": "Pantalla para seleccionar un día para ver la información de ese día en particular.",
    "pantalla4FoodFeed": "Pantalla parecida a la de inicio, pero con la información del día filtrado desde la pantalla de calendario.",
    "pantalla5FoodFeed": "Pantalla para búsqueda por texto de los alimentos, los últimos buscados son los que aparecen por defecto.",
    "pantalla6FoodFeed": "Pantalla para ver los nutrientes que tiene el alimento y añadir cuantos has consumido.",
    "videoError": "Tu navegador no soporta la etiqueta de video.",
    "videoFoodFeed": "En este vídeo se puede ver el banner promocional que se hizo para la aplicación.",
    "anterior": "Anterior",
    "siguiente": "Siguiente",
    "repoFoodFeed": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado. Si se desea acceder al código, puedo compartirlo durante una entrevista.",
    "equipoFoodFeed": "<strong>Equipo:</strong> Trabajo en equipo con otros 7 compañeros, divididos en 2 backend, 2 IA y 4 frontend.",
    "descripcionBookPixel": "<strong>Descripción del proyecto:</strong> En una asignatura universitaria, participé en un proyecto en equipo para desarrollar una aplicación Android que, mediante imagen, texto o voz, permite a los usuarios buscar información sobre libros y videojuegos, además de incluir un chatbot. El proyecto hizo uso de APIs de terceros.",
    "rolBookPixel": "<strong>Mi rol:</strong> Trabajé junto a dos compañeros en varias tareas del desarrollo, utilizando <strong>Android Studio</strong>, <strong>Java</strong>, <strong>Node.js</strong>, <strong>Typescript</strong> y <strong>Firebase</strong>. Mis principales contribuciones fueron:",
    "tarea1BookPixel": "Diseñar e implementar las Cloud Functions en Firebase.",
    "tarea2BookPixel": "Desarrollar varias pantallas de la aplicación, incluyendo la pantalla principal, las de búsqueda (imagen, texto, voz), y las pantallas de resultados, información del producto, carrito y post compra, historial, la lista de deseos y ajustes para cambiar el idioma.",
    "tarea3BookPixel": "Añadir soporte de internacionalización (i18n) (español, inglés, alemán, portugués, italiano, catalán, francés, gallego y vasco)",
    "tarea4BookPixel": "Integrar componentes de Android, como la cámara y microfóno para las búsquedas por imagen y voz.",
    "tarea5BookPixel": "Colaborar con la integración entre la aplicación y Firestore y la conexión entre app y las Cloud Functions",
    "tarea6BookPixel": "Investigar, seleccionar e integrar las APIs necesarias.",
    "lenguajesBookPixel": "<strong>Lenguajes:</strong> Java para la aplicación y Typescript para las cloud functions",
    "plataformasBookPixel": "<strong>Plataformas:</strong> Android Studio, Firebase, Google Cloud y Visual Studio Code",
    "colaboracionBookPixel": "<strong>Colaboración:</strong> Git para control de versiones y trabajo en equipo.",
    "apisBookPixel": "<strong>APIs:</strong> Google Books API, RAWG API, Google Traductor API, Google Cloud Vision, Google Cloud Speech API.",
    "capturasBookPixel": "Capturas de Pantalla - BookPixel",
    "pantallaInicioClaroBookPixel": "Pantalla de inicio en modo claro, dónde se puede ver libros y videojuegos que hayas visitado, pero no comprado",
    "pantallaInicioOscuroBookPixel": "Pantalla de inicio en modo oscuro, dónde se puede ver libros y videojuegos que hayas visitado, pero no comprado",
    "pantalla3BookPixel": "Pantalla para seleccionar entre búsqueda por texto, audio o imagen",
    "pantalla4BookPixel": "Pantalla para búsqueda por imagen, dónde se puede elegir si filtrar por libro (título o autor) o videojuego (título) elegiendo imagen de galeria o hacer una foto.",
    "pantalla5BookPixel": "Pantalla para búsqueda por texto, dónde se puede elegir filtrar por libro (título o autor y idioma) o por videojuegos (titulo, desarrollador, género o plataformas)",
    "pantalla6BookPixel": "Pantalla para búsqueda por audio, dónde se puede elegir filtrar por libro (título o autor) o por videojuegos (titulo o desarrollador)",
    "pantalla7BookPixel": "Pantalla de información del libro, dónde se puede ver la portada, la editorial, autor, título y la descripción del libro.",
    "pantalla8BookPixel": "Pantalla de información del videojuego, dónde se puede ver el título, clasificación del videojuego (según ESRB), nota en RAWG y en Metacritic, plataformas, géneros, fecha lanzamiento y descripción del videojuego",
    "pantalla9BookPixel": "Pantalla de información del videojuego, es la continuación de la anterior y se puede ver el sitio web oficial, dónde se puede comprar y la opción de añadir el videojuego al carrito",
    "pantalla10BookPixel": "Pantalla que se llega al pulsar en el botón de metacritic.",
    "pantalla11BookPixel": "Pantalla en la que se ve en un diagrama quesito la valoración que le han hecho los usuarios en RAWG",
    "pantalla12BookPixel": "Pantalla en la que se ve en un diagrama de barras la valoración que le han hecho los usuarios en RAWG",
    "pantalla13BookPixel": "Pantalla carrito, dónde se puede ver en un listado los libros y videojuegos que se han añadido al carrito, permite seleccionarlos y marcarlos como comprados",
    "pantalla14BookPixel": "Pantalla dónde se puede ver un listado de los libros visitados y de los libros comprados",
    "pantalla15BookPixel": "Pantalla dónde se puede ver un listado de los videojuegos visitados y de los comprados",
    "pantalla16BookPixel": "Pantalla dónde se puede cambiar el idioma en el cuál se muestra la aplicación (español, inglés, portugués, italiano, catalán, francés, alemán, gallego o vasco)",
    "pantalla17BookPixel": "Pantalla dónde se pueden ver videojuegos que aún no han salido pero han sido añadidos a preseleción, muestra el título, la fecha de lanzamiento y los días que quedan para el lanzamiento",
    "notaBookPixel": "<strong>Nota:</strong> Las pantallas en modo claro y oscuro son casi idénticas, solo que varía la paleta de colores, como se puede ver en la pantalla de inicio.",
    "enlaceBookPixel": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado. Si se desea acceder al código, puedo compartirlo durante una entrevista.",
    "equipoBookPixel": "<strong>Equipo:</strong> Trabajo en equipo con otros 2 compañeros.",
    "descripcionDR72": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el desarrollo de una aplicación Android que, a través de conectividad Bluetooth, permite a los usuarios visualizar en formato gráfico y textual los valores que lee el dispositivo <strong>DR72</strong>, creado por la empresa.",
    "rolDR72": "<strong>Mi rol:</strong> Trabajé principalmente de manera individual, con apoyo puntual de los desarrolladores del hardware del DR72 para la implementación de la conectividad Bluetooth. Utilicé <strong>Android Studio</strong> y <strong>Java</strong>. Mi responsabilidad principal fue desarrollar la aplicación completa, desde la interfaz de usuario hasta la comunicación con el dispositivo. Además, desarrollé un servidor web para recibir, almacenar los datos y gestionar la comunicación entre la app y el servidor.",
    "lenguajeDR72": "<strong>Lenguaje:</strong> Java",
    "plataformaDR72": "<strong>Plataforma:</strong> Android Studio",
    "colaboracionDR72": "<strong>Colaboración:</strong> Git para control de versiones.",
    "infraestructuraDR72": "<strong>Infraestructura adicional:</strong> Webserver para la gestión de datos",
    "enlaceDR72": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "enlaceDescargaDR72": "Enlace para descargar",
    "equipoDR72": "<strong>Equipo:</strong> Trabajo individual, con pequeñas colaboraciones por parte de los desarrolladores del Hardware para la parte de conectividad.",
    "capturasDR72": "Capturas de Pantalla - Appdr72",
    "pantalla1DR72": "Pantalla de inicio en modo claro",
    "pantalla2DR72": "Pantalla para buscar y conectar con el dispositivo DR72",
    "pantalla3DR72": "Pantalla de inicio en modo oscuro",
    "pantalla4DR72": "Pantalla para consultar datos de anteriores conexiones, permite buscar por cualquier fecha o por una en concreto",
    "pantalla5DR72": "Pantalla donde se pueden ver los datos que va leyendo el DR72",
    "pantalla6DR72": "Pantalla donde se pueden ver los datos que va leyendo el DR72 en formato gráfico",
    "notaDR72": "<strong>Nota:</strong> Las pantallas en modo claro y oscuro son casi idénticas, solo que varía la paleta de colores, como se puede ver en la pantalla de inicio.",
    "tituloIA": "Proyectos IA",
    "presentacionIA": "A continuación, se presentan algunos de los proyectos de machine learning en los que he trabajado, centrados en desarrollo de inteligencias artificiales predictivas utilizando tecnologías como Python y Jupyter notebook.",
    "bibliotecasUsadas": "Bibliotecas Usadas",
    "descripcionSpaceshipTitanic": "<strong>Descripción del proyecto:</strong> En una asignatura universitaria, participé en un proyecto individual en formato <strong>datathon</strong>, en 3 días se tenia que resolver un problema de clasificación, de una competición kaggle, con los datos de este <a href='https://www.kaggle.com/competitions/spaceship-titanic/overview'>link</a>.",
    "rolSpaceshipTitanic": "<strong>Mi rol:</strong> Trabajé individualmente para resolver el problema y quedar lo más arriba posible, utilizando <strong>Jupyter Notebook</strong> y <strong>Python</strong>. Mi responsabilidad principal fue analizar los datos y hacer un modelo predictivo con la mayor accuracy possible.",
    "lenguajeSpaceshipTitanic": "<strong>Lenguajes:</strong> Python",
    "plataformaSpaceshipTitanic": "<strong>Plataformas:</strong> Jupyter Notebook, kaggle para descargar los datasets y subir la solución.",
    "colaboracionSpaceshipTitanic": "<strong>Colaboración:</strong> Git para control de versiones.",
    "bibliotecasUsadasProyecto": "Bibliotecas usadas:",
    "pandasProyectos": "<strong>Pandas:</strong> Usada para el tratamiento de los distintos excels.",
    "numpyProyectos": "<strong>NumPy:</strong> Usada para tratamiento de los datos de distintos excels.",
    "matplotlibSpaceshipTitanic": "<strong>Matplotlib:</strong> Usada para dibujar gráficos a partir de los datos tratados de los excels.",
    "sklearnProyectos": "<strong>Sklearn:</strong> Usada para tratar los datos, como manejar datos faltantes, estandarizar caracteristicas, reducir dimensionalidad, dividir el conjunto de datos en conjuntos de entrenamiento y prueba de manera eficiente...",
    "warningsProyectos": "<strong>Warnings:</strong> Usada para evitar que salieran warnings del tipo \"Future Warning\"",
    "enlaceSpaceshipTitanic": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado. Si se desea acceder al código, puedo compartirlo durante una entrevista.",
    "equipoSpaceshipTitanic": "<strong>Equipo:</strong> Trabajo individual.",
    "resultadosSpaceshipTitanic": "<strong>Resultados:</strong> Con el modelo entrenado según modelo SVM, se logró un score del 0,77507.",
    "descripcionF1": "<strong>Descripción del proyecto:</strong> En una asignatura universitaria, participé en un proyecto individual en el cual intente hacer dos modelos para predecir cuantos coches iban a acabar una carrera y una carrera de sprint en la f1 a partir de los datos de este <a href='https://www.kaggle.com/datasets/rohanrao/formula-1-world-championship-1950-2020'>link</a>.",
    "rolF1": "<strong>Mi rol:</strong> Trabajé individualmente para resolver el problema, utilizando <strong>Jupyter Notebook</strong> y <strong>Python</strong>. Mi responsabilidad principal fue juntar todos los archivos que habia en 2 datasets, analizar los datos y hacer dos modelos predictivos (uno para carreras al sprint y otro para carreras normales) con la mayor accuracy possible.",
    "lenguajesF1": "<strong>Lenguajes:</strong> Python",
    "plataformasF1": "<strong>Plataformas:</strong> Jupyter Notebook, kaggle para descargar los datasets y subir la solución.",
    "colaboracionF1": "<strong>Colaboración:</strong> Git para control de versiones.",
    "matplotlibF1": "<strong>Matplotlib:</strong> Usada para dibujar gráficos a partir de los datos tratados de los excels.",
    "seabornF1": "<strong>Seaborn:</strong> Usada para dibujar gráficos estadísticos de alto nivel para realizar análisis exploratorio de datos.",
    "foliumF1": "<strong>Folium:</strong> Usada para crear un mapa de la ubicación de los circuitos de los datasets.",
    "enlaceF1": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado. Si se desea acceder al código, puedo compartirlo durante una entrevista.",
    "equipoF1": "<strong>Equipo:</strong> Trabajo individual.",
    "resultadosF1": "<strong>Resultados:</strong> Con los modelos entrenados según Gradient Boosting, se hizo una <strong>validación cruzada</strong> para ambos modelos en las cuales se pudo ver que habia <strong>overfitting</strong>, aunque se intento mitigar mediante <strong>Recursive Feature Elimination (RFE)</strong>, se logró reducir un poco el overfitting, aunque aún estaba presente.",
    "informeF1": "<strong>Informe del proyecto:</strong> Un informe detallado fue desarrollado para la entrega del proyecto. Puedo compartirlo bajo solicitud.",
    "pandas": "Biblioteca para la manipulación y análisis de datos. Proporciona estructuras de datos flexibles y herramientas para limpiar, transformar y visualizar datos.",
    "numpy": "Biblioteca fundamental para la computación científica en Python, que ofrece soporte para matrices y operaciones matemáticas de alto rendimiento.",
    "matplotlib": "Biblioteca para la creación de visualizaciones estáticas, animadas e interactivas. Ideal para gráficos de calidad.",
    "sklearn": "Biblioteca para machine learning que proporciona herramientas eficientes para clasificación, regresión, clustering y reducción de dimensionalidad. Ofrece funciones para preprocesamiento de datos, selección de modelos, optimización de hiperparámetros y evaluación de rendimiento.",
    "warnings": "Biblioteca estándard para gestionar advertencias. Se usa a menudo para suprimir mensajes de advertencia que pueden ser innecesarios.",
    "seaborn": "Biblioteca para visualización de datos basada en matplotlib. Proporciona gráficos estadísticos de alto nivel y es fácil de usar para realizar análisis exploratorio de datos (EDA).",
    "folium": "Biblioteca para crear mapas interactivos, basada en Leaflet.js. Se usa comúnmente para visualización geoespacial de datos.",
    "tituloOtros": "Otros Proyectos",
    "introOtros": "A continuación, presento otros tipos de proyectos en los que he trabajado en mi tiempo libre.",
    "descripcionFM24": "<strong>Descripción del proyecto:</strong> En mi tiempo libre, disfruto jugando al Football Manager 2024, y decidí personalizar la skin por defecto, basada en la skin <a href='https://www.fmscout.com/a-opz-elite-fm24-skin.html' title='Proyecto Base de la skin'>OpzElite</a>. Al usarla, observé algunos aspectos que quería mejorar, así que decidí editarla. Además, también creé imágenes personalizadas para ciertos futbolistas.",
    "rolFM24": "<strong>Mi rol:</strong> Trabajé junto a un amigo en la edición de esta skin, utilizando <strong>Visual Studio Code</strong> y <strong>XML</strong>. Mi responsabilidad fue:",
    "cambiar_colores": {
        "introduccion": "Cambiar los colores de algunas partes por otros más intuitivos. Por ejemplo:",
        "mensajes_buzon": "Cambiar los colores de los mensajes del buzón para diferenciar claramente los correos leídos de los no leídos.",
        "valoraciones": "Cambiar los colores de las valoraciones: rojo para las valoraciones bajas y diferentes tonos de verde para las mejores.",
        "jugadores_cedidos": "Cambiar los colores de los jugadores cedidos al club/fuera del club para que se diferencien más.",
        "preseleccion": "Cambiar el color de los jugadores que están en la preselección."
    },
    "añadir_campos" : {
        "intro": "Añadir algunos campos en determinadas pantallas del juego. Por ejemplo:",
        "estrellas": "Añadir las estrellas de calidad actual y de potencial en la vista previa del jugador en un carrusel dónde se ve la fortaleza de pierna del jugador, el representante, las cualidades del jugador, y las estrellas que es mi añadido.",
        "reputacion": "Añadir la reputación del jugador en la caja de \"Player Traits\" en la vista general del jugador.",
        "recomendacion": "Añadir en vista general de ojeo la recomendación de fichar a ese jugador."
    },
    "tarea3FM24": "Eliminé enlaces a otros mods en la sección de noticias.",
    "tarea4FM24": "Buscar en internet imágenes de futbolistas/entrenadores, editarlas para quitar el fondo y adaptarlas a un tamaño adecuado para el juego. Aunque existen packs que ya lo hacen, decidí hacerlo por mi cuenta para incluir únicamente las imágenes de los jugadores que yo quería, debido a limitaciones de espacio en mi PC, ya que estos packs suelen ocupar bastante espacio.",
    "tarea5FM24": "Incorporar las imágenes mediante XML al juego.",
    "imagenesFM24": "<strong>Imágenes antes y después de mis modificaciones:</strong>",
    "comparacionAntesDespues": "Ver Comparaciones Antes y Después",
    "tituloComparacionFM24": "Comparación Antes y Después Skin FM24",
    "imagen1AntesFM24": "<strong>Antes:</strong> El color de los mensajes leidos era blanco, y con determinada iluminación, no se llegaba a distingir bien los leidos del que estabas leyendo.",
    "imagen1DespuesFM24": "<strong>Después:</strong> El color de los mensajes leidos se cambio a azul para evitar el problema mencionado anteriormente.",
    "imagen2AntesFM24": "<strong>Antes:</strong> El color de los jugadores cedidos a otro club y el de los cedidos al club eran distintos tonos de azul, pero dependiendo de la iluminación no se diferenciaban bien.",
    "imagen2DespuesFM24": "<strong>Después:</strong> El color de los jugadores cedidos a otro equipo se cambio a lila para que se diferenciara bien.",
    "imagen3AntesFM24": "<strong>Antes:</strong> Las valoraciones de entrenamiento las mejores eran en rojo, y de alli bajaba en diferentes tonos de rojo.",
    "imagen3DespuesFM24": "<strong>Después:</strong> Las valoraciones de entrenamiento las mejores han pasado a ser verde, y en diferentes tonos de verde.",
    "imagen4AntesFM24": "<strong>Antes:</strong> En esta pantalla no salen la recomendación por fichar al jugador.",
    "imagen4DespuesFM24": "<strong>Después:</strong> Se ha agregado la recomendación por fichar al jugador en la vista.",
    "imagen5AntesFM24": "<strong>Antes:</strong> El color de los jugadores de la preselección era rojo.",
    "imagen5DespuesFM24": "<strong>Después:</strong> Se ha cambiado el color de los jugadores de la preselección a un amarillo para parecerse más a la skin original del juego.",
    "imagen6AntesFM24": "<strong>Antes:</strong> Los colores de los atributos eran de distintos tonos de rojo.",
    "imagen6DespuesFM24": "<strong>Después:</strong> Los colores de los atributos del jugador han pasado a ser como los de la skin original del juego y además en el \"Player Traits\" se ha añadido la reputación que tiene el jugador.",
    "imagen7AntesFM24": "<strong>Antes:</strong> En medio de las noticias hay una fila de otros mods como faces y logos.",
    "imagen7DespuesFM24": "<strong>Después:</strong> Ya no hay esa fila en medio y se ven todas las noticias juntas.",
    "notaFM24": "<strong>Nota:</strong> La comparación de imágenes muestra el estado antes y después de la modificación.",
    "lenguajeFM24": "<strong>Lenguaje:</strong> XML",
    "plataformaFM24": "<strong>Plataforma:</strong> Visual Studio Code",
    "colaboracionFM24": "<strong>Colaboración:</strong> Git para control de versiones.",
    "repoFM24": "<strong>Enlace al repositorio:</strong> El código está almacenado en un <a href='https://github.com/J1570841/SkinFM24' title='Repositorio privado del código de la skin FM24'>repositorio privado</a>. Puedes solicitar acceso a él si deseas ver el código.",
    "equipoFM24": "<strong>Equipo:</strong> Trabajo en equipo con otro compañero.",
    "tituloPython": "Proyectos Python",
    "introPython": "A continuación, se presentan algunos de los proyectos python en los que he trabajado, centrados en el desarrollo de aplicaciones de escritorio.",
    "descripcionARTIST": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el desarrollo de una aplicación de escritorio que, con unos datos de entrada y un máximo de 10 excels, generaba un informe para los clientes.",
    "rolARTIST": "<strong>Mi rol:</strong> Trabajé de manera individual, utilizando <strong>Python</strong>.",
    "lenguajeARTIST": "<strong>Lenguaje:</strong> Python",
    "plataformaARTIST": "<strong>Plataforma:</strong> Visual Studio Code",
    "colaboracionARTIST": "<strong>Colaboración:</strong> Git para control de versiones.",
    "matplotlibARTIST": "<strong>Matplotlib:</strong> Usada para dibujar gráficos a partir de los datos tratados de los excels.",
    "pillowARTIST": "<strong>Pillow (PIL):</strong> Usada para convertir imagenes a png.",
    "pythonDocxARTIST": "<strong>python-docx:</strong> Usada para hacer el informe en un word.",
    "tkinterARTIST": "<strong>Tkinter:</strong> Usada para crear la inteficie gráfica.",
    "tkcalendarARTIST": "<strong>tkcalendar:</strong> Usada para añadir un calendario en la interficie gráfica.",
    "fakerARTIST": "<strong>Faker:</strong> Usada para las pruebas, para generar datos falsos.",
    "unittestARTIST": "<strong>unittest:</strong> Usada para las pruebas, para generar pruebas unitarias.",
    "jsonARTIST": "<strong>json:</strong> Usada para leer y escribir en archivos json.",
    "enlaceARTIST": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoARTIST": "<strong>Equipo:</strong> Trabajo individual.",
    "pillow": "Biblioteca para la manipulación de imágenes en Python, permitiendo abrir, modificar y guardar imágenes.",
    "pythonDocx": "Biblioteca para crear y modificar documentos de Word en Python, útil para automatizar informes.",
    "tkinter": "Biblioteca para crear interfaces gráficas de usuario (GUIs) en Python, facilitando aplicaciones de escritorio.",
    "tkcalendar": "Biblioteca para añadir calendarios a aplicaciones Tkinter, útil para seleccionar fechas de forma visual.",
    "faker": "Biblioteca para generar datos ficticios, muy útil para pruebas y desarrollo.",
    "unittest": "Módulo para realizar pruebas unitarias en Python, ayudando a garantizar la calidad del código.",
    "json": "Módulo para trabajar con datos en formato JSON, permitiendo la serialización y deserialización de datos.",
    "formacionCompleta": "Mi Formación Completa",
    "experiencia": "Experiencia Profesional",
    "colaborarConmigo": "Si te gustaría colaborar o tienes alguna pregunta, no dudes en <a href='#' onclick='openModal()'>ponerte en contacto conmigo</a>!",
    "grado": "Grado en Ingenieria Informática, Mención Ingenieria del Software - UAB",
    "notaMedia": "Nota media final: 7.19",
    "añosEstudio": "Años de estudio: Septiembre 2019 - Julio 2024",
    "infoEstudios": "Durante mis estudios, he desarrollado diversas aplicaciones Android, como <a href='android.html#foodfeed'>FoodFeed</a> y <a href='android.html#bookpixel'>BookPixel</a>, así como programas de <a href='ia.html'>inteligencia artificial</a>.",
    "idiomas": "Idiomas",
    "cursoIngles": "<strong>Cursos de Inglés</strong> - Cambridge School",
    "cursoInglesA2": "Nivel A2<em>(Septiembre 2016 - Junio 2017)</em>",
    "cursoInglesB1": "Nivel B1<em>(Septiembre 2017 - Junio 2018)</em>",
    "cursoItaliano": "<strong>Curso Virtual de Italiano</strong> - Servei de Llengües UAB, plataforma Dexway",
    "cursoItalianoA1": "Nivel A1/A2 <em>(Abril 2023 - Abril 2024)</em>",
    "puesto": "Puesto: ",
    "puestoMango": "Mozo de Almacén <em>(Julio 2022 - Septiembre 2022)</em>",
    "infoMango": "Durante mi tiempo en Mango, participé en el empaquetado de productos de colgado. El trabajo consistía en tres posibles tareas:",
    "tareaMango1": "Empaquetar la ropa para su posterior envío.",
    "tareaMango2": "Comprobar que las perchas no se unieran, para evitar fallos en la cadena de transporte de la fábrica.",
    "tareaMango3": "Vigilar que la ropa no cayera al suelo en la cadena de transporte de la fábrica.",
    "aptitudesMango": "Gracias a estas experiencias, aunque no fue un trabajo directamente relacionado con la informática, adquirí varias aptitudes importantes que considero valiosas, como:",
    "aptitudMango1": "<strong>Trabajo en equipo</strong>, al colaborar en cadena para el empaquetamiento de productos de colgado.",
    "aptitudMango2": "<strong>Adaptabilidad y flexibilidad</strong>, al participar en diferentes fases del proceso de empaquetado de productos.",
    "aptitudMango3": "<strong>Atención al detalle</strong>, para asegurar que no ocurrieran errores que afectaran el flujo de trabajo.",
    "aptitudMango4": "<strong>Capacidad de aprendizaje rápido</strong>, ya que aprendí rápidamente todos los procesos y protocolos necesarios para desempeñar mis funciones en el equipo",
    "puestos": "Puestos:",
    "puestoGometrics1": "Becario IT <em>(Junio 2023 - Septiembre 2024)</em>",
    "puestoGometrics2": "Ingeniero Software Junior <em>(Septiembre 2024 - )</em>",
    "infoGometrics": "Durante mi tiempo en Gometrics, participé en diversos proyectos que abarcan diferentes plataformas, incluyendo <a href='web.html'>desarrollo web</a>, <a href='android.html#appdr72'>aplicaciones Android</a> y <a href='python.html#artist'>aplicaciones de escritorio</a>.",
    "aptitudesGometrics": "Gracias a estas experiencias, he adquirido varias aptitudes importantes, como:",
    "aptitudGometrics1": "<strong>Resolución de problemas</strong>, al enfrentar y resolver desafíos técnicos en proyectos complejos.",
    "aptitudGometrics2": "<strong>Adaptabilidad y flexibilidad</strong>, trabajando en distintos proyectos de diferentes plataformas.",
    "aptitudGometrics3": "<strong>Gestión del tiempo</strong>, para cumplir con los plazos y organizar múltiples tareas dentro de los proyectos.",
    "aptitudGometrics4": "<strong>Orientación a resultados</strong>, manteniéndome enfocado en alcanzar los objetivos y los plazos establecidos.",
    "aptitudGometrics5": "<strong>Pensamiento crítico</strong>, analizando problemas desde distintas perspectivas antes de tomar decisiones.",
    "proyectoWeb": "Proyecto Web",
    "introWeb": "A continuación, se presentan algunos de los proyectos Web en los que he trabajado, centrados en el desarrollo de páginas web.",
    "fichajes": "Fichajes",
    "mejoras": "Mejoras",
    "mrp": "Integracion MRP-ERP",
    "tituloFichajes": "Fichajes - Sistema de Control Horario",
    "descripcionFichajes": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el desarrollo de una plataforma web para fichar las entradas y las salidas de los trabajadores.",
    "rolFichajes": "<strong>Mi rol:</strong> Trabajé junto a otro compañero en la implementación del frontend y el backend de la aplicación, utilizando <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong> y <strong>PHPMyAdmin</strong> para la base de datos <strong>MySQL</strong>. Nos encargamos de:",
    "tareaFichajes1": "Diseñar e implementar la interfaz de usuario (UI), garantizando que fuera intuitiva y fácil de usar.",
    "tareaFichajes2": "Desarrollar las distintas pantallas de la plataforma web.",
    "tareaFichajes3": "Crear una API para la facilitar el desarrollo de una webapp para dispositivos móviles.",
    "tareaFichajes4": "Realizar pruebas sobre las pantallas y el sistema completo.",
    "tareasFichajes5": "Desarrollar una webapp para dispositivos móviles",
    "lenguajesFichajes": "<strong>Lenguajes:</strong> HTML, CSS, JavaScript, PHP",
    "BDFichajes": "<strong>Plataforma de base de datos:</strong> PHPMyAdmin",
    "colaboracionFichajes": "<strong>Colaboración:</strong> Git para control de versiones y trabajo en equipo, asegurando la integración continua sin conflictos.",
    "GtareasFichajes": "<strong>Gestión de Tareas:</strong> Jira y leantime para la planificación y seguimiento de tareas del proyecto.",
    "metodologiaFichajes": "<strong>Metodología:</strong> Scrumban",
    "enlaceFichajes": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoFichajes": "<strong>Equipo:</strong> Trabajo en equipo con otro compañero.",
    "tituloMejoras": "Mejoras ERP",
    "descripcionMejoras": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el desarrollo de mejoras para varios módulos del <strong>sistema ERP</strong> de la empresa, mejorando su rendimiento, optimizando algunos módulos y añadiendo nuevas funcionalidades.",
    "rolMejoras": "<strong>Mi rol:</strong> Trabajé principalmente de manera individual, utilizando <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>PHP</strong> y <strong>PHPMyAdmin</strong> para la base de datos <strong>MySQL</strong>. Mis responsabilidades principales fueron:",
    "tareaMejoras1": "Cumplir con las tareas asignadas, asegurando la correcta implementación y funcionalidad de las mejoras.",
    "tareaMejoras2": "Realizar pruebas para garantizar que los módulos optimizados funcionaran correctamente.",
    "lenguajesMejoras": "<strong>Lenguajes:</strong> HTML, CSS, JavaScript, PHP",
    "BDMejoras": "<strong>Plataforma de base de datos:</strong> PHPMyAdmin",
    "colaboracionMejoras": "<strong>Colaboración:</strong> Git para control de versiones.",
    "gTareasMejoras": "<strong>Gestión de Tareas:</strong> Jira y leantime para la planificación y seguimiento de tareas del proyecto.",
    "metodologiaMejoras": "<strong>Metodología:</strong> Scrumban",
    "enlaceMejoras": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoMejoras": "<strong>Equipo:</strong> Trabajo individual.",
    "descripcionBeamex": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el desarrollo de una <strong>automatización</strong> para la generación del documento <strong>MC6 y MC6-Ex Order Form</strong> de <strong class='tooltip-beamex'>Beamex <span class='tooltiptext'>Beamex es una empresa que ofrece soluciones de calibración para industrias.</span></strong>, optimizando el proceso a partir de una compra para generar un PDF con los datos correspondientes rellenados, eliminando errores manuales y acelerando el flujo de trabajo.",
    "rolBeamex": "<strong>Mi rol:</strong> Trabajé junto a otro compañero en el desarrollo completo de esta automatización, utilizando <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong> y <strong>PHP</strong>. Mi responsabilidad fue:",
    "tarea1Beamex": "Fui responsable del <strong>desarrollo completo</strong> de la estructura del documento en PDF, a partir del documento Word proporcionado por Beamex.",
    "tarea2Beamex": "Desarrollé la <strong>lógica de negocio</strong> para rellenar automáticamente el formulario con los datos de la compra, asegurando que la información se procesara correctamente.",
    "tarea3Beamex": "Realizar pruebas para garantizar que funciona correctamente.",
    "lenguajesBeamex": "<strong>Lenguajes:</strong> HTML, CSS, JavaScript, PHP",
    "colaboracionBeamex": "<strong>Colaboración:</strong> Git para control de versiones y trabajo en equipo.",
    "gTareasBeamex": "<strong>Gestión de Tareas:</strong> Jira para la planificación y seguimiento de tareas del proyecto.",
    "repoBeamex": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoBeamex": "<strong>Equipo:</strong> Trabajo en equipo con otro compañero.",
    "tituloMRP": "Integración MRP-ERP",
    "descripcionMRP": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en el análisis y el desarrollo de un nuevo <strong>MRP</strong> integrado en el ERP de la empresa, para sustituir al MRP que se usaba.",
    "rolMRP": "<strong>Mi rol: </strong> Trabajé junto a otro compañero en el análisi y el desarrollo de este proyecto, utilizando <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong> y <strong>PHP</strong>. Mi responsabilidad fue:",
    "tareaMRP1": "Analizar las funcionalidades del MRP anterior y consultar con los usuarios para identificar sus necesidades y requisitos.",
    "tareaMRP2": "Relacionar las tablas de datos del MRP anterior con su funcionalidad, dado que no se tenía acceso al código fuente. Esto es necesario para poder importar los datos al nuevo MRP y que se visualicen correctamente en las pantallas desarrolladas.",
    "tareaMRP3": "Desarrollar las distintas pantallas que se integraron en el ERP para el MRP.",
    "lenguajesMRP": "<strong>Lenguajes:</strong> HTML, CSS, javaScript, PHP",
    "BDMRP": "<strong>Plataforma de base de datos:</strong> PHPMyAdmin",
    "colaboracionMRP": "<strong>Colaboración:</strong> Git para control de versiones y trabajo en equipo.",
    "gTareasMRP": "<strong>Gestión de Tareas:</strong> Jira para la planificación y seguimiento de tareas del proyecto.",
    "repoMRP": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoMRP": "<strong>Equipo:</strong> Trabajo en equipo con otro compañero.",
    "proyectos_java": "Proyectos en Java",
    "tituloJava": "Proyectos Java",
    "introJava": "A continuación, se presentan algunos de los proyectos Java en los que he trabajado, centrados en el desarrollo de aplicaciones de escritorio.",
    "migracion": "Migración",
    "tituloMigracion": "Migración App RTM",
    "descripcionMigracion": "<strong>Descripción del proyecto:</strong> En <strong>Gometrics</strong>, participé en la migración de una aplicación de escritorio diseñada para <strong>Raspberry Pi</strong>, actualizando su base tecnológica de <strong>Java 8</strong> a <strong>Java 11</strong> y reescribiendo la interfaz de usuario de <strong>Swing</strong> a <strong>JavaFX</strong>, mejorando su rendimiento, mantenimiento y adaptabilidad a nuevas tecnologías.",
    "rolMigracion": "<strong>Mi rol:</strong> Trabajé junto a otro compañero en la implementación del frontend y el backend de la aplicación, utilizando <strong>Java</strong>, <strong>CSS</strong> y <strong>FXML</strong>. Mis tareas principales fueron:",
    "tareaMigracion1": "Reescribir la interfaz de usuario de Swing a JavaFX",
    "tareaMigracion2": "Corregir possibles errores que surgiesen como resultado de la migración",
    "tareaMigracion3": "Comprobar el correcto funcionamiento de la aplicación en Raspberry PI",
    "lenguajesMigracion": "<strong>Lenguajes:</strong> Java, CSS, FXML",
    "colaboracionMigracion": "<strong>Colaboración:</strong> Tortoise SVN para control de versiones y trabajo en equipo, asegurando la integración continua sin conflictos.",
    "enlaceMigracion": "<strong>Enlace al repositorio:</strong> El código está almacenado en un repositorio privado y no puede ser compartido.",
    "equipoMigracion": "<strong>Equipo:</strong> Trabajo en equipo con otro compañero.",
    "sceneBuilder": "Scene Builder (JavaFX Diseñador UI)",
    "javaLenguaje": "Java (Android Studio y Aplicaciones de escritorio)"
}
